[
  {
    "kpi_name": "Unique User Sellers",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying the number of unique users who are actively selling products. This information can help in targeting specific user segments for marketing or improving seller engagement.\n2. **Strategic Impact**: Aligns with the business objective of understanding seller engagement and performance on the platform, which can directly impact revenue generation.\n3. **Operational Value**: Helps in day-to-day operations by providing insights into the seller base and their activities, which can inform operational decisions related to seller management and support.\n4. **Decision Making**: Supports business decisions related to seller strategies, product offerings, and platform enhancements by providing data on seller participation.\n5. **Performance Monitoring**: Enables tracking of business performance by monitoring the growth or decline in the number of unique user sellers over time, indicating the health of the seller ecosystem on the platform.",
    "timestamp": "2025-08-25T00:18:32.346633"
  },
  {
    "kpi_name": "Unique Partner Sellers",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying the number of unique partners who are actively selling products. This information can help in developing targeted strategies to engage and support these partners further.\n2. **Strategic Impact**: Aligns with the business objective of expanding the partner network and increasing sales channels. Knowing the count of unique partner sellers can provide insights into the effectiveness of partner programs and overall business growth.\n3. **Operational Value**: Helps in day-to-day operations by monitoring partner engagement and performance. It can assist in identifying underperforming partners or areas for improvement.\n4. **Decision Making**: Supports business decisions related to partner management, resource allocation, and partnership strategies. The data on unique partner sellers can influence decisions on partner recruitment, training, and incentives.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of partner contribution to sales and revenue generation. It helps in evaluating the effectiveness of",
    "timestamp": "2025-08-25T00:18:34.566290"
  },
  {
    "kpi_name": "Sellers With Complete Address",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value across all evaluation criteria. \n1. **Actionability**: Business users can take action based on this metric by identifying sellers with incomplete address information and reaching out to them for updates. \n2. **Strategic Impact**: It aligns with the business objective of ensuring accurate and complete seller information, which can enhance customer trust and satisfaction. \n3. **Operational Value**: It helps in day-to-day operations by ensuring that sellers can be contacted effectively and efficiently. \n4. **Decision Making**: It supports decisions related to seller management and communication strategies. \n5. **Performance Monitoring**: It aids in tracking the performance of seller data management processes and can highlight areas for improvement.",
    "timestamp": "2025-08-25T00:18:37.850852"
  },
  {
    "kpi_name": "Sellers Per User",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in the number of sellers per user and adjusting strategies accordingly. For example, if the average number of sellers per user is decreasing, it may indicate a need to attract more sellers or improve user engagement.\n2. **Strategic Impact**: This KPI aligns with business objectives related to user engagement, marketplace growth, and revenue generation. Understanding the average number of sellers per user can help in optimizing the platform for both buyers and sellers.\n3. **Operational Value**: It can provide insights into the efficiency of the platform in terms of seller engagement and retention, which is crucial for day-to-day operations.\n4. **Decision Making**: This KPI supports decision-making processes related to marketing strategies, user acquisition, and platform enhancements. For instance, if the average number of sellers per user is high, it may indicate a need to focus on user retention strategies.",
    "timestamp": "2025-08-25T00:18:40.727890"
  },
  {
    "kpi_name": "Sellers Per Partner",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying potential areas for partnership growth or optimization based on the number of sellers per partner.\n2. **Strategic Impact**: It aligns with the business objective of understanding the distribution of seller roles among partners, which can inform partnership strategies and resource allocation.\n3. **Operational Value**: It can help in managing partner relationships and optimizing the seller-partner ecosystem on a day-to-day basis.\n4. **Decision Making**: This KPI supports decision-making by providing insights into the effectiveness of partner relationships and potential areas for improvement.\n5. **Performance Monitoring**: It helps track the performance of partnerships and assess the impact of changes in the number of sellers per partner over time.",
    "timestamp": "2025-08-25T00:18:43.645775"
  },
  {
    "kpi_name": "Top 10 Users by Seller Count",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: This KPI provides actionable insights as it identifies the top users with the most sellers, allowing businesses to focus on these users for potential partnerships, promotions, or targeted marketing strategies.\n2. **Strategic Impact**: It aligns with the business objective of maximizing seller engagement and revenue generation by highlighting key users who are driving seller activity on the platform.\n3. **Operational Value**: It can help in day-to-day operations by enabling the team to prioritize support and resources for these top users to maintain and enhance their engagement with sellers.\n4. **Decision Making**: This KPI supports decision-making processes by providing clear visibility into the users who have a significant impact on seller count, guiding strategic decisions on resource allocation and partnership opportunities.\n5. **Performance Monitoring**: It helps in tracking business performance by monitoring the growth and engagement of sellers facilitated by the top users, allowing for continuous evaluation and optimization of strategies.\n\nOverall, this K",
    "timestamp": "2025-08-25T00:18:45.720442"
  },
  {
    "kpi_name": "Top 10 Partners by Seller Count",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying the top partners with the most sellers and potentially strategizing on how to further engage or collaborate with these partners.\n2. **Strategic Impact**: This KPI aligns with the business objective of understanding and optimizing partner relationships, which can lead to increased sales and market share.\n3. **Operational Value**: It provides insights into the distribution of sellers among partners, which can help in resource allocation and partnership management on a day-to-day basis.\n4. **Decision Making**: Knowing the top partners by seller count can support decisions related to partner prioritization, investment, and collaboration strategies.\n5. **Performance Monitoring**: Tracking the top partners with the most sellers over time can help monitor the effectiveness of partnership programs and initiatives.\n\nOverall, this KPI holds high value as it provides actionable insights, aligns with strategic objectives, aids in day-to-day operations, supports decision",
    "timestamp": "2025-08-25T00:18:47.474826"
  },
  {
    "kpi_name": "Number of Sellers by Address",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying areas with high concentration of sellers and potentially adjusting marketing strategies or resource allocation accordingly.\n2. **Strategic Impact**: It aligns with business objectives as understanding the distribution of sellers by address can help in market segmentation, targeting specific regions, and expanding market reach.\n3. **Operational Value**: It may not directly impact day-to-day operations but can provide insights for long-term planning and resource allocation.\n4. **Decision Making**: It supports business decisions related to market expansion, targeting specific regions, and optimizing sales strategies.\n5. **Performance Monitoring**: It helps track business performance by providing visibility into the geographical distribution of sellers and identifying trends over time.",
    "timestamp": "2025-08-25T00:18:48.855756"
  },
  {
    "kpi_name": "Number of Sellers by Detailed Address",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "This KPI provides valuable insights into the distribution of sellers by detailed address, which can be crucial for various business functions. \n\n1. **Actionability**: Business users can take action based on this metric by identifying areas with high or low seller concentration and adjusting marketing strategies or resource allocation accordingly.\n2. **Strategic Impact**: It aligns with the business objective of understanding market presence and penetration at a granular level, which can inform strategic decisions related to expansion or targeting specific regions.\n3. **Operational Value**: It can help in optimizing operational activities such as logistics, inventory management, and customer service by understanding seller locations.\n4. **Decision Making**: This KPI supports decision-making processes by providing data on seller distribution, which can influence decisions related to partnerships, promotions, and market positioning.\n5. **Performance Monitoring**: It helps in tracking the performance of seller networks and evaluating the effectiveness of sales and distribution strategies.\n\nOverall, the Number of Sellers",
    "timestamp": "2025-08-25T00:18:50.445700"
  },
  {
    "kpi_name": "Number of Sellers Without User or Partner",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by identifying sellers without a user or partner and assigning them accordingly. This can help in improving overall seller management and engagement.\n2. **Strategic Impact**: It aligns with the strategic objective of ensuring all sellers are properly associated with a user or partner, which can enhance relationships and drive business growth.\n3. **Operational Value**: It aids in day-to-day operations by highlighting potential gaps in seller management that need to be addressed promptly.\n4. **Decision Making**: This KPI supports decision-making processes by providing insights into the status of seller relationships and enabling informed decisions on resource allocation and support.\n5. **Performance Monitoring**: It helps track business performance by monitoring the completeness of seller associations, which is crucial for maintaining a healthy ecosystem and achieving business goals.",
    "timestamp": "2025-08-25T00:18:52.086545"
  },
  {
    "kpi_name": "Number of Sellers With Both User and Partner",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying sellers who are associated with both a user and a partner. This information can be used to strategize targeted marketing campaigns, improve collaboration between users and partners, and enhance overall customer experience.\n2. **Strategic Impact**: This KPI aligns with the business objective of enhancing relationships with both users and partners, which can lead to increased sales, improved customer loyalty, and strengthened partnerships.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into the overlap between user and partner relationships, allowing for more efficient resource allocation and tailored engagement strategies.\n4. **Decision Making**: This KPI supports business decisions by enabling data-driven decisions related to user-partner interactions, product offerings, and partnership management.\n5. **Performance Monitoring**: It helps track business performance by measuring the effectiveness of initiatives aimed at bridging the gap between users and partners,",
    "timestamp": "2025-08-25T00:18:54.245622"
  },
  {
    "kpi_name": "Number of Sellers With Either User or Partner",
    "table_name": "tb_market_seller",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying sellers who are associated with either a user or a partner, but not both. This information can help in targeting specific sellers for tailored marketing strategies or partnership opportunities.\n2. **Strategic Impact**: This KPI aligns with the business objective of optimizing seller relationships and maximizing revenue streams by understanding the distribution of sellers across user and partner categories.\n3. **Operational Value**: It can provide insights into the distribution of sellers, which can aid in resource allocation, relationship management, and operational efficiency.\n4. **Decision Making**: The KPI supports decision-making processes by highlighting potential areas for improvement in seller engagement strategies and partnership development.\n5. **Performance Monitoring**: Tracking the number of sellers with either user or partner associations can help monitor the effectiveness of initiatives aimed at increasing seller engagement and partnerships.\n\nOverall, this KPI holds high value as it provides actionable insights, align",
    "timestamp": "2025-08-25T00:18:56.068113"
  },
  {
    "kpi_name": "Total Orders",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in total orders, identifying peak periods, and adjusting inventory levels or marketing strategies accordingly.\n2. **Strategic Impact**: Total Orders align with the business objective of increasing sales and revenue, making it a crucial KPI for tracking overall business volume.\n3. **Operational Value**: It helps with day-to-day operations by providing insights into demand patterns, allowing for better resource allocation and inventory management.\n4. **Decision Making**: Total Orders support business decisions related to production planning, marketing campaigns, and sales forecasting.\n5. **Performance Monitoring**: It enables tracking of business performance over time and comparing it against targets or benchmarks, aiding in assessing the effectiveness of business strategies.",
    "timestamp": "2025-08-25T00:18:57.709707"
  },
  {
    "kpi_name": "Total Unique Customers",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "Total Unique Customers is a crucial KPI with high business value. \n\n1. **Actionability**: Business users can take action based on this metric by analyzing customer acquisition and retention strategies, identifying trends, and targeting specific customer segments for marketing campaigns.\n2. **Strategic Impact**: Aligns with the strategic objective of understanding and growing the customer base, which is essential for business growth and sustainability.\n3. **Operational Value**: Helps in day-to-day operations by providing insights into customer behavior, preferences, and overall market penetration.\n4. **Decision Making**: Supports various business decisions such as product development, pricing strategies, and customer service improvements based on customer feedback.\n5. **Performance Monitoring**: Enables tracking of business performance by monitoring customer growth, market share, and customer satisfaction levels.\n\nOverall, Total Unique Customers is a high-value KPI as it directly impacts business growth, customer engagement, and strategic decision-making.",
    "timestamp": "2025-08-25T00:18:59.545622"
  },
  {
    "kpi_name": "Average Orders per Customer",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in customer ordering behavior and implementing targeted marketing strategies to increase customer engagement.\n2. **Strategic Impact**: Aligns with the business objective of improving customer engagement, which can lead to increased customer loyalty and retention.\n3. **Operational Value**: Helps in understanding customer behavior patterns and can inform operational decisions related to inventory management, customer service, and sales forecasting.\n4. **Decision Making**: Supports decision-making processes by providing insights into customer preferences and behaviors, enabling data-driven decisions.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of customer engagement and can be used to set benchmarks and goals for improvement.",
    "timestamp": "2025-08-25T00:19:01.976692"
  },
  {
    "kpi_name": "Total Deliveries",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "Total Deliveries is a crucial KPI that holds high business value. \n\n1. **Actionability**: Business users can take action based on this metric by analyzing delivery trends, identifying bottlenecks, and optimizing delivery processes to improve efficiency.\n2. **Strategic Impact**: Aligns with business objectives as delivery volume directly impacts customer satisfaction, operational efficiency, and overall business performance.\n3. **Operational Value**: Helps in day-to-day operations by providing insights into delivery performance, resource allocation, and capacity planning.\n4. **Decision Making**: Supports decision-making processes by enabling data-driven decisions related to logistics, supply chain management, and customer service.\n5. **Performance Monitoring**: Enables tracking of business performance by monitoring delivery metrics, identifying deviations from targets, and implementing corrective measures.\n\nOverall, Total Deliveries is a high-value KPI that plays a critical role in driving operational excellence, enhancing customer experience, and achieving business goals.",
    "timestamp": "2025-08-25T00:19:04.158254"
  },
  {
    "kpi_name": "Average Delivery Time",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take direct action based on this metric by identifying bottlenecks in the delivery process and implementing improvements to reduce delivery times.\n2. **Strategic Impact**: Aligns with the business objective of improving efficiency in the delivery process, which can lead to increased customer satisfaction and retention.\n3. **Operational Value**: Helps in optimizing day-to-day operations by identifying areas for improvement and streamlining the delivery process.\n4. **Decision Making**: Supports decision-making by providing insights into the efficiency of the delivery process and guiding decisions on resource allocation and process improvements.\n5. **Performance Monitoring**: Enables tracking of business performance by monitoring the average delivery time and setting benchmarks for improvement.",
    "timestamp": "2025-08-25T00:19:05.530966"
  },
  {
    "kpi_name": "Total Refunds",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "Total Refunds is a high-value KPI for the following reasons:\n1. **Actionability**: Business users can take direct action based on this metric to identify trends, root causes of refunds, and implement strategies to reduce them.\n2. **Strategic Impact**: Aligns with the business objective of improving customer satisfaction and reducing costs by minimizing refunds.\n3. **Operational Value**: Helps in day-to-day operations by providing insights into customer behavior, product quality issues, or service gaps that lead to refunds.\n4. **Decision Making**: Supports decision-making processes by highlighting areas that require attention and investment to enhance overall business performance.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of customer satisfaction, product/service quality, and operational efficiency.\n\nOverall, Total Refunds is a valuable KPI that can drive operational improvements, cost savings, and customer satisfaction enhancements within the business.",
    "timestamp": "2025-08-25T00:19:07.474923"
  },
  {
    "kpi_name": "Refund Rate",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "The Refund Rate KPI holds high business value for the following reasons:\n1. **Actionability**: Business users can take direct action based on this metric by identifying trends in refund rates, investigating root causes, and implementing corrective measures to improve the quality of products or services.\n2. **Strategic Impact**: It aligns with the strategic objective of maintaining high-quality products/services, which is crucial for customer satisfaction and retention.\n3. **Operational Value**: Monitoring refund rates can help in identifying operational inefficiencies, product defects, or service issues that need immediate attention to enhance overall operational performance.\n4. **Decision Making**: This KPI supports data-driven decision-making by providing insights into customer satisfaction levels, product/service quality, and areas for improvement.\n5. **Performance Monitoring**: It serves as a key indicator to track the performance of the business in delivering satisfactory products/services and maintaining customer trust.\n\nOverall, the Refund Rate KPI is of high value",
    "timestamp": "2025-08-25T00:19:09.486205"
  },
  {
    "kpi_name": "Total Default Deliveries",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying areas where default deliveries are occurring frequently and implementing corrective measures to reduce them.\n2. **Strategic Impact**: Default delivery preference is a crucial aspect of customer satisfaction and retention, aligning with the business objective of providing excellent service.\n3. **Operational Value**: Monitoring total default deliveries can help in improving operational efficiency by addressing issues in the delivery process.\n4. **Decision Making**: This KPI supports decision-making by providing insights into delivery performance and areas that require attention.\n5. **Performance Monitoring**: Tracking total default deliveries helps in monitoring business performance and identifying trends over time.",
    "timestamp": "2025-08-25T00:19:11.279481"
  },
  {
    "kpi_name": "Average Order Size",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "The Average Order Size KPI holds high business value for the following reasons:\n1. **Actionability**: Business users can take direct action based on this metric by adjusting pricing strategies, bundling products, or offering promotions to increase the average order size.\n2. **Strategic Impact**: It aligns with the business objective of maximizing revenue and profitability by understanding and influencing customer purchase behavior.\n3. **Operational Value**: It can help in optimizing inventory management, forecasting demand, and improving overall operational efficiency.\n4. **Decision Making**: This KPI supports decision-making processes related to product assortment, marketing campaigns, and sales strategies.\n5. **Performance Monitoring**: It provides a clear indicator of how well the business is performing in terms of driving higher value transactions.",
    "timestamp": "2025-08-25T00:19:12.983232"
  },
  {
    "kpi_name": "Total Selected Deliveries",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the total number of selected deliveries to understand customer delivery preferences. They can adjust their delivery strategies, optimize routes, or allocate resources accordingly.\n2. **Strategic Impact**: This KPI aligns with the business objective of meeting customer preferences and enhancing overall customer satisfaction, which is crucial for long-term success.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by helping in managing delivery schedules, improving efficiency, and meeting customer demands effectively.\n4. **Decision Making**: The data from this KPI can support decision-making processes related to inventory management, resource allocation, and customer service improvements.\n5. **Performance Monitoring**: It helps in tracking business performance by monitoring the trends in selected deliveries, identifying patterns, and evaluating the effectiveness of delivery strategies.\n\nOverall, the Total Selected Deliveries KPI holds high value as it not only provides actionable insights",
    "timestamp": "2025-08-25T00:19:16.205508"
  },
  {
    "kpi_name": "Total Unique Delivery Addresses",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the distribution of delivery addresses and identifying areas with high or low customer concentration. This can help in optimizing delivery routes, targeting marketing efforts, and improving customer service.\n2. **Strategic Impact**: It aligns with the business objective of enhancing customer delivery experience and satisfaction by ensuring delivery location diversity.\n3. **Operational Value**: It can assist in optimizing operational processes such as logistics, inventory management, and resource allocation based on the distribution of delivery addresses.\n4. **Decision Making**: This KPI supports decision-making related to expanding delivery coverage, identifying potential new markets, and improving overall customer reach.\n5. **Performance Monitoring**: It helps in tracking the business performance by monitoring the growth in the number of unique delivery addresses over time, indicating an increase in customer base and market penetration.\n\nOverall, the Total Unique Delivery Addresses KPI holds high value as it provides actionable",
    "timestamp": "2025-08-25T00:19:17.986548"
  },
  {
    "kpi_name": "Average Deliveries per Customer",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in customer behavior and adjusting delivery strategies to improve engagement.\n2. **Strategic Impact**: It aligns with the business objective of enhancing customer engagement, which is crucial for long-term success and loyalty.\n3. **Operational Value**: It can help in optimizing delivery operations by understanding customer preferences and demand patterns.\n4. **Decision Making**: This KPI supports decision-making by providing insights into customer behavior and preferences, enabling informed decisions on delivery strategies.\n5. **Performance Monitoring**: It helps track business performance by measuring the effectiveness of delivery services in engaging customers and driving repeat business.",
    "timestamp": "2025-08-25T00:19:20.716278"
  },
  {
    "kpi_name": "Total Unique Delivery Names",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "This KPI of Total Unique Delivery Names holds high value for the business based on the evaluation criteria provided. \n\n1. **Actionability**: Business users can take action based on this metric by analyzing the diversity of customer delivery preferences. They can tailor their delivery services to meet the varied needs of customers.\n2. **Strategic Impact**: It aligns with the business objective of enhancing customer satisfaction and loyalty by offering diverse delivery options.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into customer preferences, enabling efficient delivery planning and execution.\n4. **Decision Making**: This KPI supports business decisions related to delivery strategies, inventory management, and customer service improvements.\n5. **Performance Monitoring**: It helps track business performance by monitoring the effectiveness of delivery services and identifying areas for improvement.\n\nOverall, Total Unique Delivery Names KPI is of high value as it not only provides actionable insights for operational improvements but also aligns with strategic",
    "timestamp": "2025-08-25T00:19:22.490509"
  },
  {
    "kpi_name": "Total Unique Delivery IDs",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the diversity of deliveries and identifying areas where there may be a lack of variety or potential for improvement.\n2. **Strategic Impact**: It aligns with the business objective of ensuring a diverse range of deliveries, which can lead to increased customer satisfaction and loyalty.\n3. **Operational Value**: It can help in optimizing delivery processes and ensuring efficient operations by monitoring the uniqueness of delivery IDs.\n4. **Decision Making**: This KPI can support decisions related to delivery strategies, resource allocation, and customer segmentation based on delivery preferences.\n5. **Performance Monitoring**: It helps in tracking the performance of delivery operations and assessing the effectiveness of strategies aimed at enhancing delivery diversity.",
    "timestamp": "2025-08-25T00:19:23.924591"
  },
  {
    "kpi_name": "Total Unique User IDs",
    "table_name": "tb_oem_market_order",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the growth or decline in the total number of unique user IDs. They can tailor marketing strategies, improve user engagement, or target specific user segments based on this data.\n2. **Strategic Impact**: The size of the user base is crucial for business growth and revenue generation. Understanding the total unique user IDs aligns with the strategic objective of expanding the customer base.\n3. **Operational Value**: Knowing the total unique user IDs can help in resource allocation, capacity planning, and customer service management, thereby enhancing day-to-day operations.\n4. **Decision Making**: This KPI supports decision-making processes related to marketing campaigns, product development, customer retention strategies, and overall business growth.\n5. **Performance Monitoring**: Tracking the total unique user IDs over time allows businesses to monitor the effectiveness of their initiatives and assess the impact on business performance.\n\nOverall, the Total Unique",
    "timestamp": "2025-08-25T00:19:25.688980"
  },
  {
    "kpi_name": "Total Subscriptions",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in subscription numbers, identifying factors influencing subscription growth or decline, and adjusting marketing or retention strategies accordingly.\n2. **Strategic Impact**: Understanding the total number of subscriptions directly aligns with the strategic objective of increasing customer base and revenue.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations such as forecasting demand, resource planning, and evaluating the effectiveness of subscription-related initiatives.\n4. **Decision Making**: The total subscriptions KPI supports decision-making processes related to marketing budget allocation, product development prioritization, and customer segmentation strategies.\n5. **Performance Monitoring**: Tracking total subscriptions helps monitor the overall business performance and assess the success of subscription acquisition and retention efforts.",
    "timestamp": "2025-08-25T00:19:27.207679"
  },
  {
    "kpi_name": "Total Active Subscriptions",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "Total Active Subscriptions is a high-value KPI for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by analyzing trends in subscription numbers, identifying churn rates, and implementing strategies to retain or acquire more subscribers.\n2. **Strategic Impact**: It aligns with the business objective of maximizing revenue and customer retention by providing insights into the overall health of the subscription business model.\n3. **Operational Value**: It helps in day-to-day operations by monitoring subscription growth, identifying potential issues, and optimizing subscription management processes.\n4. **Decision Making**: This KPI supports decision-making by providing data-driven insights for pricing strategies, marketing campaigns, and product development based on subscription trends.\n5. **Performance Monitoring**: It helps track business performance by measuring the success of subscription initiatives, forecasting revenue streams, and evaluating the effectiveness of subscription-related investments.",
    "timestamp": "2025-08-25T00:19:28.837069"
  },
  {
    "kpi_name": "Total Inactive Subscriptions",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value for the business due to the following reasons:\n1. **Actionability**: Business users can take action based on this metric by identifying trends in inactive subscriptions and implementing strategies to re-engage or retain customers.\n2. **Strategic Impact**: It aligns with the business objective of improving customer retention and revenue generation by addressing inactive subscriptions.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into customer behavior and subscription management.\n4. **Decision Making**: This KPI supports decision-making processes related to customer relationship management, marketing strategies, and product offerings.\n5. **Performance Monitoring**: It aids in tracking business performance by monitoring the impact of efforts to reduce inactive subscriptions and improve customer engagement.",
    "timestamp": "2025-08-25T00:19:30.364264"
  },
  {
    "kpi_name": "Subscription Duration",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in subscription duration and adjusting marketing strategies, pricing models, or customer retention efforts accordingly.\n2. **Strategic Impact**: Understanding the average lifespan of subscriptions directly aligns with business objectives related to customer retention, revenue forecasting, and overall business growth.\n3. **Operational Value**: This KPI can help in optimizing operational processes related to subscription management, customer engagement, and resource allocation.\n4. **Decision Making**: It supports decision-making processes by providing insights into customer behavior, preferences, and loyalty, which can inform strategic decisions on product development, pricing, and marketing campaigns.\n5. **Performance Monitoring**: Tracking subscription duration allows businesses to monitor the effectiveness of their subscription offerings, customer satisfaction levels, and overall business performance.\n\nOverall, the Subscription Duration KPI holds high value as it provides actionable insights, aligns with strategic objectives, aids in day-to-day operations",
    "timestamp": "2025-08-25T00:19:32.395069"
  },
  {
    "kpi_name": "Subscriptions by Partner",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying top-performing partners and allocating resources accordingly to drive more subscriptions.\n2. **Strategic Impact**: Understanding the distribution of subscriptions across partners aligns with the strategic objective of optimizing partner relationships and maximizing subscription revenue.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations by helping in partner management and resource allocation.\n4. **Decision Making**: It supports decision-making processes by providing data on partner performance and guiding strategic partnership decisions.\n5. **Performance Monitoring**: Tracking subscriptions by partner helps in monitoring the performance of different partners and evaluating the effectiveness of partnership strategies.",
    "timestamp": "2025-08-25T00:19:33.809822"
  },
  {
    "kpi_name": "Active Subscriptions by Partner",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which partners have the most active subscriptions and potentially strategizing on how to increase subscriptions with other partners.\n2. **Strategic Impact**: This KPI aligns with the business objective of understanding the distribution of active subscriptions across partners, which is crucial for partnership management and revenue generation.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into partner performance and subscription trends, allowing for targeted actions to improve subscription numbers.\n4. **Decision Making**: This KPI supports business decisions related to partner relationships, marketing strategies, and resource allocation based on subscription distribution.\n5. **Performance Monitoring**: It helps track business performance by monitoring the growth or decline of active subscriptions by partner, enabling timely adjustments to business strategies.\n\nOverall, the KPI of Active Subscriptions by Partner holds high value as it provides actionable insights, aligns with strategic objectives,",
    "timestamp": "2025-08-25T00:19:35.511971"
  },
  {
    "kpi_name": "Inactive Subscriptions by Partner",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value across all evaluation criteria. \n1. **Actionability**: Business users can take action based on this metric by identifying partners with a high number of inactive subscriptions and implementing targeted strategies to re-engage those customers.\n2. **Strategic Impact**: It aligns with the business objective of improving customer retention and revenue generation by addressing inactive subscriptions.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into partner-specific subscription trends and facilitating proactive measures to reduce churn.\n4. **Decision Making**: It supports decision-making processes by enabling data-driven decisions on partnership strategies and resource allocation.\n5. **Performance Monitoring**: It aids in tracking business performance by monitoring the impact of initiatives aimed at reducing inactive subscriptions and improving overall subscription health.",
    "timestamp": "2025-08-25T00:19:37.195752"
  },
  {
    "kpi_name": "Subscriptions by Plan",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value across all evaluation criteria. \n1. Actionability: Business users can take action based on this metric by identifying trends in subscription plans and adjusting marketing strategies or product offerings accordingly.\n2. Strategic Impact: It aligns with the business objective of understanding customer preferences and optimizing revenue streams.\n3. Operational Value: It helps in day-to-day operations by providing insights into which plans are popular and may require more resources or attention.\n4. Decision Making: It supports business decisions related to pricing, promotions, and product development based on the distribution of subscriptions.\n5. Performance Monitoring: It enables tracking of business performance by monitoring changes in subscription plan preferences over time.",
    "timestamp": "2025-08-25T00:19:38.763307"
  },
  {
    "kpi_name": "Active Subscriptions by Plan",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which subscription plans are popular and which may need adjustments or promotions to increase uptake.\n2. **Strategic Impact**: Understanding the distribution of active subscriptions across plans aligns with the strategic objective of optimizing revenue streams and customer segmentation.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into the performance of different subscription plans and guiding operational decisions.\n4. **Decision Making**: This KPI supports decision-making by providing data on subscription plan preferences, which can influence marketing strategies, pricing decisions, and product development.\n5. **Performance Monitoring**: It helps track business performance by monitoring the success of different subscription plans and identifying trends over time.",
    "timestamp": "2025-08-25T00:19:40.509164"
  },
  {
    "kpi_name": "Inactive Subscriptions by Plan",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by identifying which subscription plans have a higher rate of inactivity and then strategizing ways to re-engage or improve those plans.\n2. **Strategic Impact**: It aligns with the business objective of maximizing subscription retention and revenue generation by providing insights into plan-specific churn rates.\n3. **Operational Value**: It helps in day-to-day operations by highlighting areas that require attention in terms of customer engagement and retention strategies.\n4. **Decision Making**: It supports business decisions by enabling data-driven decisions on resource allocation, marketing strategies, and product improvements based on the distribution of inactive subscriptions.\n5. **Performance Monitoring**: It aids in tracking business performance by monitoring the effectiveness of initiatives aimed at reducing inactivity and improving customer retention across different subscription plans.",
    "timestamp": "2025-08-25T00:19:42.220455"
  },
  {
    "kpi_name": "Subscriptions by Fee",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI provides valuable insights into the distribution of subscriptions across different fee levels, which can help in understanding customer behavior, pricing strategies, and revenue generation. \n\n1. **Actionability**: Business users can take action based on this metric by adjusting pricing strategies, targeting specific customer segments, or offering promotions to drive subscriptions.\n2. **Strategic Impact**: It aligns with the strategic objective of maximizing revenue and understanding customer preferences, making it crucial for decision-making.\n3. **Operational Value**: It can help in optimizing operations by identifying trends in subscription fees and adjusting resources accordingly.\n4. **Decision Making**: This KPI supports decision-making related to pricing, marketing strategies, and product offerings based on subscription fee preferences.\n5. **Performance Monitoring**: It helps in tracking the performance of subscription-based revenue streams and evaluating the effectiveness of pricing strategies.",
    "timestamp": "2025-08-25T00:19:44.216699"
  },
  {
    "kpi_name": "Active Subscriptions by Fee",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value across all evaluation criteria. \n1. **Actionability**: Business users can take action based on this metric by adjusting pricing strategies, targeting specific fee segments for promotions, or optimizing subscription packages.\n2. **Strategic Impact**: It aligns with the strategic objective of understanding customer segmentation and revenue distribution, which is crucial for business growth and profitability.\n3. **Operational Value**: It provides insights for day-to-day operations such as identifying trends in subscription fees, forecasting revenue, and optimizing resource allocation.\n4. **Decision Making**: This KPI supports decision-making processes related to pricing, marketing strategies, and product development based on the distribution of active subscriptions by fee.\n5. **Performance Monitoring**: It helps track the performance of subscription offerings and assess the effectiveness of pricing strategies in attracting and retaining customers.",
    "timestamp": "2025-08-25T00:19:46.018531"
  },
  {
    "kpi_name": "Inactive Subscriptions by Fee",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by identifying trends in inactive subscriptions across different fee categories and implementing targeted strategies to re-engage customers.\n2. **Strategic Impact**: Understanding the distribution of inactive subscriptions aligns with the strategic objective of improving customer retention and revenue generation.\n3. **Operational Value**: It provides insights that can help in optimizing subscription offerings and pricing strategies to reduce churn.\n4. **Decision Making**: This KPI supports data-driven decision-making by highlighting areas that require attention and investment to improve overall business performance.\n5. **Performance Monitoring**: It helps track the performance of subscription services and assess the effectiveness of retention efforts over time.",
    "timestamp": "2025-08-25T00:19:47.659859"
  },
  {
    "kpi_name": "Subscriptions by Super User Type",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which super user types are driving the most subscriptions and potentially adjusting marketing strategies or product offerings to cater to these user types.\n2. **Strategic Impact**: Understanding the distribution of subscriptions across super user types aligns with the strategic objective of targeting and retaining high-value customers.\n3. **Operational Value**: This KPI can help in day-to-day operations by providing insights into the performance of different user types and guiding resource allocation.\n4. **Decision Making**: It supports business decisions by providing data on which super user types are most valuable and where to focus efforts.\n5. **Performance Monitoring**: Tracking subscriptions by super user type helps in monitoring the performance of marketing campaigns and overall business growth.",
    "timestamp": "2025-08-25T00:19:49.186473"
  },
  {
    "kpi_name": "Active Subscriptions by Super User Type",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value across all evaluation criteria. \n1. **Actionability**: Business users can take action based on this metric by identifying trends in active subscriptions among different super user types and adjusting strategies accordingly.\n2. **Strategic Impact**: It aligns with the business objective of understanding the distribution of active subscriptions, which is crucial for targeting and retaining different user segments effectively.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into the performance of different super user types and guiding operational decisions.\n4. **Decision Making**: This KPI supports business decisions by providing data on the distribution of active subscriptions, enabling informed decision-making processes.\n5. **Performance Monitoring**: It helps track business performance by monitoring the engagement and retention of different super user types, which is essential for assessing the overall health of the subscription business.",
    "timestamp": "2025-08-25T00:19:50.671671"
  },
  {
    "kpi_name": "Inactive Subscriptions by Super User Type",
    "table_name": "tb_subscribe_partner",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value across all evaluation criteria. \n1. Actionability: Business users can take action by targeting specific super user types with high numbers of inactive subscriptions to improve retention strategies.\n2. Strategic Impact: Understanding the distribution of inactive subscriptions aligns with the strategic objective of improving customer retention and revenue growth.\n3. Operational Value: It helps in identifying areas that need attention and resources to improve operational efficiency in managing subscriptions.\n4. Decision Making: This KPI supports data-driven decision-making by providing insights into which super user types are most affected by inactive subscriptions.\n5. Performance Monitoring: It enables tracking of business performance in terms of subscription retention and identifying trends over time.",
    "timestamp": "2025-08-25T00:19:52.152348"
  },
  {
    "kpi_name": "Total Factories",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the distribution of factories across regions, optimizing production processes, or identifying areas for expansion.\n2. **Strategic Impact**: Knowing the total number of factories aligns with strategic objectives related to production capacity, market presence, and supply chain management.\n3. **Operational Value**: It helps in managing day-to-day operations by providing insights into the overall manufacturing infrastructure.\n4. **Decision Making**: This KPI supports decisions related to resource allocation, production planning, and investment in new facilities.\n5. **Performance Monitoring**: Tracking the total number of factories allows for monitoring the growth or contraction of the manufacturing footprint, which is crucial for assessing business performance.",
    "timestamp": "2025-08-25T00:19:54.178783"
  },
  {
    "kpi_name": "Factories by Region",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying regions with high or low factory presence and adjusting strategies accordingly.\n2. **Strategic Impact**: It aligns with the business objective of understanding the regional distribution of factories, which can inform expansion plans or resource allocation.\n3. **Operational Value**: It can help in day-to-day operations by providing insights into the geographical spread of production facilities.\n4. **Decision Making**: This KPI supports decision-making processes related to market penetration, supply chain management, and resource allocation.\n5. **Performance Monitoring**: It helps track business performance by monitoring the growth or decline of factories in different regions, indicating market trends and potential opportunities.\n\nOverall, the \"Factories by Region\" KPI holds high value as it provides actionable insights, aligns with strategic objectives, aids in operational decision-making, and facilitates performance monitoring.",
    "timestamp": "2025-08-25T00:19:55.833675"
  },
  {
    "kpi_name": "Factories by Industrial Complex",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying underperforming or overburdened industrial complexes and allocating resources accordingly.\n2. **Strategic Impact**: Understanding the distribution of factories across industrial complexes aligns with the strategic objective of optimizing operational efficiency and resource allocation.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations by helping in resource planning, capacity management, and identifying potential bottlenecks.\n4. **Decision Making**: It supports decision-making processes by providing data on the performance and utilization of industrial complexes, aiding in strategic decisions related to expansion, consolidation, or optimization.\n5. **Performance Monitoring**: Tracking the number of factories in each industrial complex helps in monitoring the performance of different locations and assessing the overall business performance.\n\nOverall, this KPI holds high value as it provides actionable insights, aligns with strategic objectives, supports operational efficiency, aids in decision-making processes",
    "timestamp": "2025-08-25T00:19:57.684020"
  },
  {
    "kpi_name": "Factories by Corporation Type",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value across all evaluation criteria. \n1. Actionability: Business users can take action based on this metric by identifying trends in factory distribution and making strategic decisions on resource allocation or expansion plans.\n2. Strategic Impact: Understanding the distribution of factories across corporation types aligns with the strategic objective of optimizing operations and resources.\n3. Operational Value: It provides valuable insights for day-to-day operations, such as identifying areas for improvement or potential risks.\n4. Decision Making: This KPI supports decision-making processes by providing data on the distribution of factories, which can influence strategic decisions.\n5. Performance Monitoring: It helps track business performance by monitoring the distribution of factories and assessing the effectiveness of operational strategies.",
    "timestamp": "2025-08-25T00:19:59.738890"
  },
  {
    "kpi_name": "Factories by Business Type",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in the distribution of factories across different business types. They can allocate resources, adjust strategies, or target specific business types for growth.\n2. **Strategic Impact**: Understanding the distribution of factories across business types aligns with the strategic objective of optimizing resource allocation and market targeting.\n3. **Operational Value**: This KPI can provide insights for operational decisions such as production planning, supply chain management, and identifying potential areas for improvement.\n4. **Decision Making**: The data on factories by business type can support decisions related to market segmentation, product development, and expansion strategies.\n5. **Performance Monitoring**: Tracking the number of factories for each business type can help monitor the performance of different segments and evaluate the effectiveness of business strategies.\n\nOverall, this KPI holds high value as it provides actionable insights, aligns with strategic objectives, supports operational decisions, aids in",
    "timestamp": "2025-08-25T00:20:01.948794"
  },
  {
    "kpi_name": "Factories by Size",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in factory sizes and potentially adjusting strategies or resource allocation accordingly.\n2. **Strategic Impact**: Understanding the distribution of factories across different sizes aligns with the strategic objective of optimizing operations and resources.\n3. **Operational Value**: This KPI can provide insights into the operational efficiency and capacity utilization of factories, aiding in day-to-day operations management.\n4. **Decision Making**: The data on factories by size can support decisions related to expansion, consolidation, or resource allocation based on the distribution patterns.\n5. **Performance Monitoring**: Tracking the distribution of factories by size can help monitor the overall performance and growth of the business in terms of production capacity.\n\nOverall, the KPI \"Factories by Size\" holds high value as it provides actionable insights, aligns with strategic objectives, aids in operational decision-making, and supports performance monitoring.",
    "timestamp": "2025-08-25T00:20:05.516656"
  },
  {
    "kpi_name": "Factories with Contact Information",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by reaching out to factories for various purposes such as collaboration, issue resolution, or partnership opportunities.\n2. **Strategic Impact**: It aligns with the business objective of maintaining effective communication and relationships with factories, which can impact supply chain efficiency and overall business performance.\n3. **Operational Value**: Having contact information readily available can streamline day-to-day operations, especially in cases of emergencies or urgent communication needs.\n4. **Decision Making**: The availability of contact information can support decisions related to supplier management, risk mitigation, and operational planning.\n5. **Performance Monitoring**: Tracking the number of factories with contact information can serve as a performance indicator for the effectiveness of communication strategies and supplier relationship management.",
    "timestamp": "2025-08-25T00:20:08.063961"
  },
  {
    "kpi_name": "Factories with Representative Information",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying factories lacking representative information and working towards updating or improving the information.\n2. **Strategic Impact**: It aligns with the business objective of ensuring accurate and up-to-date information for decision-making processes.\n3. **Operational Value**: It helps in day-to-day operations by ensuring that the necessary information is available for efficient functioning of the factories.\n4. **Decision Making**: Having representative information for factories supports informed decision-making related to resource allocation, production planning, and performance evaluation.\n5. **Performance Monitoring**: This KPI helps track the performance of factories in terms of information availability, which is crucial for assessing overall business performance.",
    "timestamp": "2025-08-25T00:20:09.929580"
  },
  {
    "kpi_name": "Factories by Area",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying areas with high or low concentration of factories and adjusting their strategies accordingly.\n2. **Strategic Impact**: Understanding the distribution of factories across areas is crucial for strategic planning, resource allocation, and market expansion.\n3. **Operational Value**: It can help in optimizing supply chain logistics, managing inventory levels, and improving production efficiency.\n4. **Decision Making**: This KPI supports decisions related to market penetration, site selection for new factories, and resource allocation.\n5. **Performance Monitoring**: Tracking the number of factories in each area can provide insights into the growth or decline of operations in different regions, aiding in performance monitoring.\n\nOverall, the KPI \"Factories by Area\" holds high business value as it provides actionable insights, aligns with strategic objectives, aids in day-to-day operations, supports decision-making processes, and helps in monitoring business performance effectively.",
    "timestamp": "2025-08-25T00:20:13.477810"
  },
  {
    "kpi_name": "Factories with Complete Address",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by ensuring that all factories have complete address information, which can help in improving logistics, supply chain management, and overall operational efficiency.\n2. **Strategic Impact**: It aligns with the business objective of having accurate and up-to-date information about factories, which is crucial for effective decision-making and strategic planning.\n3. **Operational Value**: Having complete address information for factories can streamline operations, reduce errors in deliveries, and enhance communication with suppliers and customers.\n4. **Decision Making**: This KPI supports business decisions related to location-based strategies, risk management, and compliance with regulations.\n5. **Performance Monitoring**: It helps track the performance of the organization in terms of data accuracy, compliance, and operational efficiency related to factory locations.",
    "timestamp": "2025-08-25T00:20:15.182468"
  },
  {
    "kpi_name": "Factories by Company Name",
    "table_name": "tb_sales_factory",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying companies with a high number of factories and potentially optimizing resources or production processes.\n2. **Strategic Impact**: Understanding the distribution of factories across companies aligns with the strategic objective of resource allocation and market presence.\n3. **Operational Value**: This KPI can help in day-to-day operations by providing insights into production capacity and potential collaboration opportunities.\n4. **Decision Making**: It supports decision-making processes related to resource allocation, expansion strategies, and partnerships.\n5. **Performance Monitoring**: Tracking the number of factories for each company can help monitor the growth and efficiency of operations.\n\nOverall, this KPI provides valuable insights that can be leveraged for both strategic decision-making and operational optimization, making it a high-value metric for the business.",
    "timestamp": "2025-08-25T00:20:17.456263"
  },
  {
    "kpi_name": "Total Service Types",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying gaps in service offerings, optimizing service portfolio, and making informed decisions on introducing new services.\n2. **Strategic Impact**: Understanding the total number of service types aligns with the strategic objective of diversifying and expanding service offerings to cater to a wider customer base.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into the breadth of services offered, enabling better resource allocation and service delivery management.\n4. **Decision Making**: This KPI supports business decisions by providing data on the range of services available, aiding in strategic planning and market positioning.\n5. **Performance Monitoring**: Tracking the total service types helps in monitoring business performance, identifying trends, and evaluating the effectiveness of service offerings.\n\nOverall, the Total Service Types KPI holds high value as it contributes to actionable insights, strategic alignment, operational efficiency, informed decision-making, and",
    "timestamp": "2025-08-25T00:20:20.212273"
  },
  {
    "kpi_name": "Visible Service Types",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying gaps in service types visibility and potentially expanding or optimizing the range of services offered to partners.\n2. **Strategic Impact**: Understanding the total number of service types visible to partners aligns with the strategic objective of enhancing partner experience and satisfaction.\n3. **Operational Value**: This KPI can help in day-to-day operations by ensuring that all relevant service types are visible to partners, leading to smoother transactions and improved partner relationships.\n4. **Decision Making**: It supports business decisions by providing insights into the effectiveness of service visibility strategies and guiding decisions on service portfolio management.\n5. **Performance Monitoring**: Tracking the total number of visible service types can help monitor the performance of service visibility initiatives and assess the impact on partner engagement.\n\nOverall, the KPI of Visible Service Types holds high value as it not only provides actionable insights for business users but also aligns with strategic",
    "timestamp": "2025-08-25T00:20:21.854755"
  },
  {
    "kpi_name": "Service Types Requiring File",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by identifying service types that require a file and ensuring proper file management processes are in place.\n2. **Strategic Impact**: It aligns with the business objective of ensuring efficient service delivery by understanding the requirements for each service type.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into the file requirements for different service types, enabling operational teams to streamline processes.\n4. **Decision Making**: This KPI supports decision-making by providing data on the number of service types requiring a file, which can influence resource allocation and process improvements.\n5. **Performance Monitoring**: It aids in tracking business performance by monitoring the total number of service types that require a file, which can indicate efficiency and compliance with service requirements.",
    "timestamp": "2025-08-25T00:20:23.357334"
  },
  {
    "kpi_name": "Service Types Not Requiring File",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying service types that do not require a file and potentially streamlining processes or resources allocated to those services.\n2. **Strategic Impact**: It aligns with the business objective of optimizing operational efficiency by understanding the nature of service types that do not require a file.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by helping in resource allocation and process optimization.\n4. **Decision Making**: This KPI supports decision-making by providing data on service types that can influence resource allocation and process improvement strategies.\n5. **Performance Monitoring**: It helps in tracking business performance by monitoring the efficiency of services that do not require a file, which can impact overall operational performance.",
    "timestamp": "2025-08-25T00:20:24.794098"
  },
  {
    "kpi_name": "Open Service Types",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which service types are currently open and potentially allocating resources or prioritizing tasks accordingly.\n2. **Strategic Impact**: This KPI aligns with the business objective of ensuring efficient service delivery by monitoring the status of different service types.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by indicating the workload distribution and areas that may require attention.\n4. **Decision Making**: The count of open service types can support decision-making processes related to resource allocation, service prioritization, and overall service management.\n5. **Performance Monitoring**: It helps track business performance by indicating the current status of service types and identifying any bottlenecks or inefficiencies in the service delivery process.",
    "timestamp": "2025-08-25T00:20:26.497584"
  },
  {
    "kpi_name": "New Service Types",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by understanding the introduction of new service types and potentially adjusting marketing strategies, pricing, or resource allocation accordingly.\n2. **Strategic Impact**: It aligns with the business objective of innovation and diversification by tracking the introduction of new service types.\n3. **Operational Value**: It may not directly impact day-to-day operations but can provide insights into potential shifts in customer demand or market trends.\n4. **Decision Making**: It supports strategic decision-making by providing data on the expansion of service offerings and identifying areas for growth.\n5. **Performance Monitoring**: It helps track business performance by indicating the organization's ability to adapt and introduce new services to meet evolving customer needs.",
    "timestamp": "2025-08-25T00:20:28.455550"
  },
  {
    "kpi_name": "Hidden Service Types",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "This KPI holds high value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by identifying hidden service types and potentially uncovering reasons for their concealment. This can lead to adjustments in marketing strategies, pricing, or service offerings.\n2. **Strategic Impact**: Understanding the total number of hidden service types aligns with the strategic objective of optimizing service visibility and ensuring all offerings are effectively promoted.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into the current status of service types and highlighting areas that may need attention or improvement.\n4. **Decision Making**: This KPI supports decision-making processes by providing data on hidden service types, which can influence decisions related to product development, marketing campaigns, and resource allocation.\n5. **Performance Monitoring**: It aids in tracking business performance by monitoring changes in the count of hidden service types over time, indicating improvements or potential issues in",
    "timestamp": "2025-08-25T00:20:30.346548"
  },
  {
    "kpi_name": "Deleted Service Types",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which service types are being deleted frequently and investigate the reasons behind it. They can then make informed decisions on whether to reinstate certain service types or improve the offerings.\n2. **Strategic Impact**: Understanding the total number of deleted service types aligns with the business objective of optimizing service offerings and ensuring customer satisfaction. It helps in identifying trends and patterns that can drive strategic decisions.\n3. **Operational Value**: This KPI provides operational value by helping in managing and maintaining the service types effectively. It allows for better resource allocation and prioritization.\n4. **Decision Making**: The count of deleted service types can support business decisions related to product development, marketing strategies, and customer retention efforts.\n5. **Performance Monitoring**: Monitoring the number of deleted service types can track the effectiveness of service offerings and highlight areas that need improvement, thus aiding in performance monitoring.\n\nOverall",
    "timestamp": "2025-08-25T00:20:32.498002"
  },
  {
    "kpi_name": "Service Types With Images",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying service types without images and prioritizing them for image creation. This can improve the overall quality and attractiveness of the services offered.\n2. **Strategic Impact**: It aligns with the business objective of enhancing the customer experience and increasing engagement by providing visual representations of services.\n3. **Operational Value**: It can help in day-to-day operations by ensuring that all service types are adequately represented with images, which can lead to better marketing and sales outcomes.\n4. **Decision Making**: This KPI supports decision-making by providing insights into which service types may need more visual content to drive customer interest and conversion.\n5. **Performance Monitoring**: It helps track business performance by measuring the progress in adding images to service types and assessing the impact on customer engagement.\n\nOverall, this KPI holds high value as it not only provides actionable insights for improving service representation but also align",
    "timestamp": "2025-08-25T00:20:34.224969"
  },
  {
    "kpi_name": "Service Types Without Parent",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying primary service types that may require further attention or resources.\n2. **Strategic Impact**: It aligns with the business objective of understanding the structure and hierarchy of service types, which can inform strategic decisions related to service offerings.\n3. **Operational Value**: It provides insights into the primary services offered, which can be valuable for day-to-day operations such as resource allocation and service prioritization.\n4. **Decision Making**: This KPI supports business decisions by highlighting the importance of primary service types and their impact on the overall service portfolio.\n5. **Performance Monitoring**: It helps track business performance by indicating the distribution and relevance of primary service types within the organization.",
    "timestamp": "2025-08-25T00:20:38.697254"
  },
  {
    "kpi_name": "Service Types By Root Type",
    "table_name": "tb_type_service",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by understanding the distribution of service types by root service type. This information can help in optimizing service offerings, identifying areas for improvement, and tailoring marketing strategies.\n2. **Strategic Impact**: It aligns with business objectives as it provides insights into the overall service portfolio and can guide strategic decisions related to service development and resource allocation.\n3. **Operational Value**: It can help with day-to-day operations by identifying trends in service usage, enabling better resource planning, and improving service delivery efficiency.\n4. **Decision Making**: This KPI supports business decisions by providing a clear overview of service types and their distribution, which can inform decisions on product development, customer targeting, and market positioning.\n5. **Performance Monitoring**: It helps track business performance by monitoring the effectiveness of different service types and their impact on overall business outcomes.\n\nOverall, the KPI \"Service Types By",
    "timestamp": "2025-08-25T00:20:42.672330"
  },
  {
    "kpi_name": "Total Number of Payment Methods",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying gaps in payment methods and implementing strategies to offer more diverse payment options to customers.\n2. **Strategic Impact**: It aligns with the business objective of enhancing customer experience and increasing customer satisfaction by providing a variety of payment methods.\n3. **Operational Value**: It helps in day-to-day operations by ensuring that the business is catering to the payment preferences of a wide range of customers.\n4. **Decision Making**: It supports business decisions related to expanding payment options, optimizing payment processes, and improving overall financial performance.\n5. **Performance Monitoring**: It helps track business performance by indicating the effectiveness of the payment methods in driving sales and revenue.\n\nOverall, the Total Number of Payment Methods KPI holds high value as it provides insights into customer preferences, supports strategic goals, aids in operational efficiency, facilitates decision-making, and enables performance monitoring.",
    "timestamp": "2025-08-25T00:20:44.764534"
  },
  {
    "kpi_name": "Number of Active Payment Methods",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which payment methods are being used the most and least, allowing them to optimize the payment process.\n2. **Strategic Impact**: Aligns with the business objective of providing a seamless payment experience to customers, which can lead to increased customer satisfaction and retention.\n3. **Operational Value**: Helps in day-to-day operations by ensuring that all active payment methods are functioning properly and meeting customer needs.\n4. **Decision Making**: Supports business decisions by providing insights into which payment methods are preferred by customers and where improvements can be made.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of payment method usage and effectiveness.",
    "timestamp": "2025-08-25T00:20:46.463445"
  },
  {
    "kpi_name": "Number of Deleted Payment Methods",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing why payment methods are being deleted and implementing strategies to improve retention or introduce new payment methods.\n2. **Strategic Impact**: It aligns with the business objective of optimizing payment methods and ensuring a seamless payment experience for customers.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into the efficiency and effectiveness of payment methods management.\n4. **Decision Making**: It supports decision-making by identifying trends in payment method deletion and guiding strategic decisions on payment method offerings.\n5. **Performance Monitoring**: It helps track business performance by indicating changes in customer behavior or preferences regarding payment methods.",
    "timestamp": "2025-08-25T00:20:48.417695"
  },
  {
    "kpi_name": "Number of Personal Cards",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in the number of personal cards and making decisions on marketing strategies, product offerings, or customer segmentation.\n2. **Strategic Impact**: Understanding the number of personal cards aligns with business objectives related to customer acquisition, retention, and revenue generation.\n3. **Operational Value**: It can help in operational activities such as inventory management, customer service planning, and resource allocation based on card usage patterns.\n4. **Decision Making**: This KPI supports decision-making processes related to product development, customer targeting, and overall business growth strategies.\n5. **Performance Monitoring**: Tracking the number of personal cards can provide insights into the effectiveness of marketing campaigns, customer satisfaction levels, and overall business performance.\n\nOverall, the Number of Personal Cards KPI holds high value as it can inform various aspects of the business, from strategic planning to day-to-day operations and performance monitoring.",
    "timestamp": "2025-08-25T00:20:50.450745"
  },
  {
    "kpi_name": "Number of Corporate Cards",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in the number of corporate cards and making decisions on card issuance, usage policies, and cost management.\n2. **Strategic Impact**: Aligns with business objectives related to financial management, expense control, and employee spending behavior.\n3. **Operational Value**: Helps in managing day-to-day operations related to financial transactions, expense tracking, and compliance monitoring.\n4. **Decision Making**: Supports decisions on budget allocation, vendor negotiations, and financial planning based on the usage of corporate cards.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of expense management efficiency, cost control measures, and compliance with financial policies.",
    "timestamp": "2025-08-25T00:20:51.883644"
  },
  {
    "kpi_name": "Number of Payment Methods by Partner",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying partners with limited payment methods and working to expand the options available to them. This can improve partner satisfaction and increase transaction volume.\n2. **Strategic Impact**: Understanding the distribution of payment methods aligns with the strategic objective of enhancing partner relationships and optimizing payment processes.\n3. **Operational Value**: It provides insights into day-to-day operations by highlighting potential areas for improvement in payment method offerings.\n4. **Decision Making**: This KPI supports decision-making by guiding resource allocation towards expanding payment methods for partners where it is most needed.\n5. **Performance Monitoring**: It helps track business performance by monitoring the effectiveness of efforts to diversify payment methods and improve partner satisfaction.",
    "timestamp": "2025-08-25T00:20:53.432157"
  },
  {
    "kpi_name": "Number of Payment Methods by User",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in payment method usage and optimizing the user experience accordingly. For example, if a significant portion of users are using a specific payment method, the business can focus on improving the integration or offering incentives for using other methods.\n2. **Strategic Impact**: Understanding the distribution of payment methods aligns with the business objective of enhancing customer experience and increasing conversion rates. It can also help in identifying potential partnerships with payment providers to offer more options to users.\n3. **Operational Value**: This KPI provides insights into the operational efficiency of payment processing systems and can help in streamlining processes related to payment methods.\n4. **Decision Making**: The data from this KPI can support decisions related to marketing strategies, product offerings, and partnerships with payment providers.\n5. **Performance Monitoring**: Tracking the number of payment methods by user can help in monitoring the effectiveness of initiatives",
    "timestamp": "2025-08-25T00:20:55.076168"
  },
  {
    "kpi_name": "Number of Payment Methods by Type",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying popular payment methods and optimizing the checkout process to cater to customer preferences.\n2. **Strategic Impact**: It aligns with business objectives by providing insights into customer behavior and preferences, which can inform strategic decisions related to product offerings and marketing strategies.\n3. **Operational Value**: It helps with day-to-day operations by enabling the monitoring of payment method trends and ensuring that the necessary infrastructure is in place to support various payment types.\n4. **Decision Making**: It supports business decisions by providing data-driven insights into customer payment preferences, which can influence decisions related to partnerships with payment providers or the introduction of new payment methods.\n5. **Performance Monitoring**: It helps track business performance by monitoring changes in payment method usage over time and evaluating the impact of any changes made to payment processes.\n\nOverall, the Number of Payment Methods by Type KPI holds high value as it provides",
    "timestamp": "2025-08-25T00:20:57.127507"
  },
  {
    "kpi_name": "Number of New Payment Methods per Month",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in the number of new payment methods added per month. They can identify which payment methods are gaining popularity and allocate resources accordingly.\n2. **Strategic Impact**: This KPI aligns with the business objective of understanding the growth rate of payment methods, which is crucial for staying competitive in the market.\n3. **Operational Value**: It provides insights into operational efficiency and effectiveness in introducing new payment methods, which can streamline payment processes.\n4. **Decision Making**: The data from this KPI can support strategic decisions related to partnerships with payment providers, marketing strategies, and customer preferences.\n5. **Performance Monitoring**: It helps track the business performance in terms of adapting to changing payment trends and meeting customer demands. \n\nOverall, the Number of New Payment Methods per Month KPI holds high value as it provides actionable insights, aligns with strategic objectives, aids in",
    "timestamp": "2025-08-25T00:20:59.659620"
  },
  {
    "kpi_name": "Number of Deleted Payment Methods per Month",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the reasons behind payment method deletions and implementing strategies to reduce them, such as improving user experience or addressing security concerns.\n2. **Strategic Impact**: Understanding the rate of payment method deletion aligns with the business objective of enhancing customer satisfaction and retention, as a high deletion rate may indicate dissatisfaction with payment options.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into customer behavior and preferences related to payment methods, enabling operational adjustments to meet customer needs.\n4. **Decision Making**: This KPI supports business decisions by highlighting trends in payment method deletions that can influence product development, marketing strategies, or customer service initiatives.\n5. **Performance Monitoring**: Tracking the number of deleted payment methods per month allows for monitoring the effectiveness of implemented changes and measuring progress towards reducing deletion rates, thus aiding in performance evaluation.\n\nOverall, the Number",
    "timestamp": "2025-08-25T00:21:01.419277"
  },
  {
    "kpi_name": "Number of Active Payment Methods per Partner",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying partners with a low number of active payment methods and working to increase their options, potentially improving revenue streams.\n2. **Strategic Impact**: Aligns with the business objective of optimizing partner relationships and revenue generation by ensuring a diverse range of payment methods.\n3. **Operational Value**: Helps in day-to-day operations by providing insights into partner payment preferences and facilitating targeted strategies.\n4. **Decision Making**: Supports decisions related to partner management, marketing strategies, and product offerings based on payment method popularity.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of partner engagement and satisfaction through payment method diversity.",
    "timestamp": "2025-08-25T00:21:03.276227"
  },
  {
    "kpi_name": "Number of Active Payment Methods per User",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying users with fewer active payment methods and targeting them for promotions or incentives to increase the number of payment methods used.\n2. **Strategic Impact**: It aligns with the business objective of increasing customer engagement and satisfaction by offering a variety of payment options.\n3. **Operational Value**: It helps in optimizing payment processes and identifying trends in payment method preferences among users.\n4. **Decision Making**: It supports decisions related to marketing strategies, product offerings, and customer segmentation based on payment behavior.\n5. **Performance Monitoring**: It helps track the effectiveness of initiatives aimed at increasing the number of active payment methods per user and overall user engagement.",
    "timestamp": "2025-08-25T00:21:04.849183"
  },
  {
    "kpi_name": "Number of Active Personal Cards per User",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying users with a high number of active personal cards and potentially targeting them for specific promotions or offers.\n2. **Strategic Impact**: Understanding the distribution of active personal cards aligns with the business objective of increasing customer engagement and loyalty.\n3. **Operational Value**: It can help in managing card-related operations such as card issuance, activation, and monitoring.\n4. **Decision Making**: This KPI supports decision-making processes related to marketing strategies, customer segmentation, and product offerings.\n5. **Performance Monitoring**: Tracking the number of active personal cards per user can provide insights into the effectiveness of marketing campaigns and customer retention efforts.",
    "timestamp": "2025-08-25T00:21:06.590871"
  },
  {
    "kpi_name": "Number of Active Corporate Cards per Partner",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying partners with a high number of active corporate cards and potentially offering them tailored services or incentives to increase card usage.\n2. **Strategic Impact**: This KPI aligns with the business objective of optimizing partner relationships and revenue generation through corporate card usage.\n3. **Operational Value**: It helps in managing day-to-day operations related to partner engagement and card utilization.\n4. **Decision Making**: The data from this KPI can support decisions on resource allocation, partner segmentation, and marketing strategies.\n5. **Performance Monitoring**: It enables tracking of business performance in terms of partner engagement and revenue generation through corporate card usage.",
    "timestamp": "2025-08-25T00:21:07.931617"
  },
  {
    "kpi_name": "Number of Active Payment Methods by Type per Month",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in the usage of different payment methods and adjusting strategies accordingly. For example, if a certain payment method is declining in usage, the business can investigate the reasons and make necessary changes.\n2. **Strategic Impact**: This KPI aligns with the business objective of optimizing payment methods to enhance customer experience and increase revenue. Understanding the distribution of active payment methods by type can help in strategic decision-making related to payment processing.\n3. **Operational Value**: It provides operational value by giving insights into the performance of different payment methods on a monthly basis, allowing for operational adjustments to be made as needed.\n4. **Decision Making**: This KPI supports business decisions related to payment method offerings, marketing strategies, and customer engagement initiatives. It can help in identifying opportunities for improvement and growth.\n5. **Performance Monitoring**: It helps in tracking the performance of payment methods",
    "timestamp": "2025-08-25T00:21:09.680137"
  },
  {
    "kpi_name": "Number of Deleted Payment Methods by Type per Month",
    "table_name": "tb_payment_method",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in deleted payment methods by type and addressing any issues or inefficiencies.\n2. **Strategic Impact**: Understanding the monthly distribution of deleted payment methods by type can align with the business objective of improving payment method management and customer experience.\n3. **Operational Value**: It provides insights into day-to-day operations related to payment method management, allowing for adjustments and improvements as needed.\n4. **Decision Making**: This KPI supports decision-making processes by providing data on which types of payment methods are being deleted and potentially influencing strategic decisions related to payment offerings.\n5. **Performance Monitoring**: It helps track the performance of payment methods and assess the effectiveness of any changes made to payment methods over time.\n\nOverall, this KPI holds high value as it not only provides actionable insights for day-to-day operations but also aligns with strategic objectives and aids in decision-making processes related",
    "timestamp": "2025-08-25T00:21:12.256083"
  },
  {
    "kpi_name": "Total Cart Items",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in total cart items and adjusting marketing strategies, promotions, or inventory levels accordingly to drive sales.\n2. **Strategic Impact**: Understanding the total potential sales volume aligns with the business objective of maximizing revenue and profitability.\n3. **Operational Value**: It can help with day-to-day operations by providing insights into customer behavior and preferences, allowing for targeted marketing efforts.\n4. **Decision Making**: This KPI supports business decisions related to inventory management, pricing strategies, and marketing campaigns.\n5. **Performance Monitoring**: Tracking total cart items helps monitor business performance in terms of sales volume and customer engagement.",
    "timestamp": "2025-08-25T00:21:13.702788"
  },
  {
    "kpi_name": "Unique Products in Carts",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the types of unique products added to carts and adjusting marketing strategies or inventory accordingly.\n2. **Strategic Impact**: Understanding the variety of products in demand aligns with the business objective of meeting customer needs and maximizing sales potential.\n3. **Operational Value**: This KPI can help in optimizing inventory management and product assortment to ensure a diverse range of products are available to customers.\n4. **Decision Making**: It supports decision-making processes related to product offerings, promotions, and marketing campaigns.\n5. **Performance Monitoring**: Tracking the number of unique products in carts can provide insights into customer preferences and help monitor the effectiveness of marketing efforts.\n\nOverall, the Unique Products in Carts KPI holds high value as it provides actionable insights, aligns with strategic objectives, aids in day-to-day operations, supports decision-making, and helps monitor business performance effectively.",
    "timestamp": "2025-08-25T00:21:15.456097"
  },
  {
    "kpi_name": "Average Cart Size",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in average cart size to adjust marketing strategies, pricing, or product offerings to increase the average purchase volume.\n2. **Strategic Impact**: Understanding the typical customer purchase volume aligns with the business objective of increasing revenue and customer satisfaction.\n3. **Operational Value**: It can help with day-to-day operations by providing insights into customer behavior and preferences, allowing for targeted promotions or inventory management.\n4. **Decision Making**: This KPI supports business decisions related to product assortment, pricing strategies, and marketing campaigns.\n5. **Performance Monitoring**: Tracking the average cart size over time helps monitor the effectiveness of business initiatives and overall business performance.",
    "timestamp": "2025-08-25T00:21:17.710800"
  },
  {
    "kpi_name": "Cart Creation Rate",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in cart creation rates and implementing strategies to improve customer engagement.\n2. **Strategic Impact**: Monitoring daily customer engagement aligns with the strategic objective of enhancing customer experience and increasing sales.\n3. **Operational Value**: This KPI provides insights into day-to-day operations by indicating the level of customer interaction with the platform.\n4. **Decision Making**: The data from this KPI can support decisions related to marketing campaigns, product placement, and website optimization.\n5. **Performance Monitoring**: It helps track business performance by measuring the effectiveness of customer engagement strategies.",
    "timestamp": "2025-08-25T00:21:19.572263"
  },
  {
    "kpi_name": "Product Popularity",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by focusing on promoting or optimizing the sales of the top-selling products.\n2. **Strategic Impact**: Identifying top-selling products aligns with the strategic objective of maximizing revenue and market share.\n3. **Operational Value**: Knowing the most popular products can help in inventory management, marketing strategies, and product development.\n4. **Decision Making**: This KPI supports decision-making processes related to product assortment, pricing, and promotional activities.\n5. **Performance Monitoring**: Tracking the popularity of products provides a clear indication of how well the business is performing in terms of sales and customer preferences.",
    "timestamp": "2025-08-25T00:21:21.448859"
  },
  {
    "kpi_name": "User Cart Activity",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing user cart activity to identify trends, preferences, and potential areas for improvement in the user experience.\n2. **Strategic Impact**: Understanding individual user engagement aligns with the strategic objective of enhancing customer experience and increasing conversion rates.\n3. **Operational Value**: This KPI can provide insights into day-to-day operations by helping to optimize the checkout process, product recommendations, and marketing strategies.\n4. **Decision Making**: It supports business decisions by informing targeted marketing campaigns, product development, and personalized user experiences.\n5. **Performance Monitoring**: Tracking user cart activity allows for monitoring business performance in terms of user engagement, conversion rates, and revenue generation.",
    "timestamp": "2025-08-25T00:21:22.894655"
  },
  {
    "kpi_name": "Cart Item Diversity",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the product diversity in customer purchases. They can adjust marketing strategies, product offerings, or promotions to enhance diversity and potentially increase sales.\n2. **Strategic Impact**: Understanding product diversity aligns with the business objective of catering to a wide range of customer preferences and increasing customer satisfaction.\n3. **Operational Value**: It can help in optimizing inventory management, identifying popular products, and improving cross-selling opportunities.\n4. **Decision Making**: This KPI supports decision-making processes related to product assortment, pricing strategies, and marketing campaigns.\n5. **Performance Monitoring**: It helps track business performance by providing insights into customer behavior and preferences, which can lead to improved sales and revenue.",
    "timestamp": "2025-08-25T00:21:26.508861"
  },
  {
    "kpi_name": "Cart Conversion Rate",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "The Cart Conversion Rate KPI holds high value across all evaluation criteria. \n\n1. **Actionability**: Business users can take direct action based on this metric by identifying factors that may be hindering cart conversions and implementing strategies to improve the conversion rate.\n2. **Strategic Impact**: It aligns with the strategic objective of increasing sales and revenue by focusing on improving the effectiveness of the cart-to-purchase process.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by highlighting areas for optimization in the e-commerce process.\n4. **Decision Making**: This KPI supports informed decision-making by indicating the performance of the cart conversion process and guiding adjustments to enhance conversion rates.\n5. **Performance Monitoring**: It effectively tracks business performance by measuring the success of converting carts into actual purchases, which is a critical aspect of e-commerce success.\n\nOverall, the Cart Conversion Rate KPI is of high value as it not only provides actionable insights",
    "timestamp": "2025-08-25T00:21:28.858512"
  },
  {
    "kpi_name": "Cart Abandonment Rate",
    "table_name": "tb_market_cart",
    "rating": "HIGH VALUE",
    "reason": "The Cart Abandonment Rate KPI holds high value across all evaluation criteria. \n\n1. **Actionability**: Business users can take direct action based on this metric by identifying reasons for cart abandonment and implementing strategies to reduce it, such as improving website usability, optimizing checkout process, or offering incentives to complete purchases.\n\n2. **Strategic Impact**: It aligns with the strategic objective of maximizing sales revenue by addressing potential lost sales. By monitoring and improving cart abandonment rate, businesses can enhance their conversion rates and overall revenue.\n\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations by highlighting specific areas where customers are dropping off in the sales funnel. It enables operational teams to focus on optimizing these touchpoints to drive conversions.\n\n4. **Decision Making**: The Cart Abandonment Rate KPI supports data-driven decision making by providing a clear indication of customer behavior and preferences. Businesses can make informed decisions on marketing strategies,",
    "timestamp": "2025-08-25T00:21:30.647265"
  }
]