[
  {
    "kpi_name": "Total Virtual Accounts Used",
    "table_name": "tb_payment",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in virtual account usage, identifying underutilized accounts, and optimizing their usage.\n2. **Strategic Impact**: Virtual account usage is directly related to financial transactions and can impact revenue generation and cost management strategies.\n3. **Operational Value**: Monitoring total virtual accounts used can help in managing operational efficiency, identifying potential bottlenecks, and improving transaction processes.\n4. **Decision Making**: This KPI can support decisions related to resource allocation, marketing strategies, and customer segmentation based on virtual account usage patterns.\n5. **Performance Monitoring**: Tracking total virtual accounts used provides a clear indicator of business performance in terms of digital transactions and customer engagement. \n\nOverall, Total Virtual Accounts Used is a high-value KPI as it provides actionable insights, aligns with strategic objectives, supports operational efficiency, aids decision-making processes, and helps in monitoring business performance effectively.",
    "timestamp": "2025-08-24T23:59:47.905393"
  },
  {
    "kpi_name": "Average Transactions per Virtual Account",
    "table_name": "tb_payment",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying virtual accounts with low transaction frequency and implementing targeted strategies to increase engagement.\n2. **Strategic Impact**: Aligns with the business objective of increasing virtual account usage and engagement, which can lead to higher customer satisfaction and retention.\n3. **Operational Value**: Helps in optimizing operational processes related to virtual account management and transaction processing.\n4. **Decision Making**: Supports decision-making by providing insights into customer behavior and preferences, enabling data-driven decisions to improve virtual account performance.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of virtual account transaction frequency, allowing for continuous monitoring and adjustment of strategies.\n\nOverall, this KPI holds high value as it not only provides actionable insights for improving virtual account performance but also aligns with strategic objectives, aids in day-to-day operations, supports decision-making, and helps in monitoring business performance effectively.",
    "timestamp": "2025-08-24T23:59:49.662708"
  },
  {
    "kpi_name": "Total Sales",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "Total Sales is a crucial KPI that holds high business value across all evaluation criteria. \n1. **Actionability**: Business users can take direct action based on this metric by analyzing sales performance, identifying trends, and adjusting strategies to drive revenue.\n2. **Strategic Impact**: Total Sales aligns perfectly with the core business objective of generating revenue and profitability.\n3. **Operational Value**: It provides essential insights for day-to-day operations, such as inventory management, pricing strategies, and sales forecasting.\n4. **Decision Making**: Total Sales supports critical business decisions related to budgeting, resource allocation, and product development.\n5. **Performance Monitoring**: It serves as a key indicator to track business performance over time and against set targets. \n\nOverall, Total Sales is a high-value KPI that plays a central role in assessing and driving the financial health of the business.",
    "timestamp": "2025-08-24T23:59:52.269757"
  },
  {
    "kpi_name": "Average Sales Price",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "The Average Sales Price KPI provides valuable insights into the average income generated per product sold, which is crucial for business decision-making and performance monitoring. It is actionable as it allows business users to analyze pricing strategies, product performance, and overall revenue generation. Additionally, it aligns with strategic objectives by helping to optimize pricing strategies and improve overall profitability. This KPI also offers operational value by providing a clear understanding of product performance and revenue generation on a day-to-day basis. Overall, the Average Sales Price KPI is highly valuable for the business.",
    "timestamp": "2025-08-24T23:59:53.570899"
  },
  {
    "kpi_name": "Total Units Sold",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in total units sold to adjust marketing strategies, inventory levels, and pricing.\n2. **Strategic Impact**: Total Units Sold aligns with the business objective of increasing revenue and market share by providing insights into sales volume.\n3. **Operational Value**: It helps with day-to-day operations by tracking sales performance, identifying popular products, and forecasting demand.\n4. **Decision Making**: This KPI supports decision-making processes such as inventory management, product development, and sales forecasting.\n5. **Performance Monitoring**: Total Units Sold helps track business performance by measuring sales growth, market penetration, and customer demand.",
    "timestamp": "2025-08-24T23:59:55.316370"
  },
  {
    "kpi_name": "Average Units per Order",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in average units per order and adjusting marketing strategies, pricing, or product offerings accordingly to increase order size.\n2. **Strategic Impact**: It aligns with the business objective of maximizing revenue by understanding and optimizing the average order size.\n3. **Operational Value**: It helps in day-to-day operations by providing insights into customer purchasing behavior and can inform inventory management and fulfillment processes.\n4. **Decision Making**: This KPI supports decision-making by providing a clear metric to evaluate the effectiveness of sales and marketing efforts in driving larger orders.\n5. **Performance Monitoring**: It helps track business performance by monitoring changes in the average units per order over time and comparing it against targets or benchmarks.",
    "timestamp": "2025-08-24T23:59:56.845194"
  },
  {
    "kpi_name": "Total Orders",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in order volume, identifying peak times, and adjusting resources accordingly.\n2. **Strategic Impact**: Aligns with the business objective of understanding customer demand and optimizing operations to meet that demand.\n3. **Operational Value**: Helps in day-to-day operations by providing real-time insights into order volume, allowing for efficient resource allocation.\n4. **Decision Making**: Supports decision-making processes by providing data on order trends, customer behavior, and market demand.\n5. **Performance Monitoring**: Enables tracking of business performance by monitoring changes in order volume over time and comparing it against targets or benchmarks.",
    "timestamp": "2025-08-24T23:59:58.399538"
  },
  {
    "kpi_name": "Total Products",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the variety of products sold and making decisions on product assortment, marketing strategies, and inventory management.\n2. **Strategic Impact**: It aligns with the business objective of understanding product diversity and can help in identifying market trends and customer preferences.\n3. **Operational Value**: It can assist in optimizing inventory levels, forecasting demand, and improving supply chain management.\n4. **Decision Making**: The total number of unique products sold can support decisions related to product development, pricing strategies, and market positioning.\n5. **Performance Monitoring**: It helps track business performance by indicating the success of product launches, identifying popular products, and evaluating the effectiveness of marketing campaigns.",
    "timestamp": "2025-08-25T00:00:02.659583"
  },
  {
    "kpi_name": "Sales by Product",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying top-performing products and allocating resources accordingly.\n2. **Strategic Impact**: It aligns with the business objective of maximizing revenue by providing insights into the revenue contribution of each product.\n3. **Operational Value**: It helps with day-to-day operations by guiding inventory management, marketing strategies, and product development efforts.\n4. **Decision Making**: It supports business decisions such as pricing strategies, product promotions, and discontinuation of underperforming products.\n5. **Performance Monitoring**: It helps track business performance by monitoring the sales performance of individual products and overall revenue trends.",
    "timestamp": "2025-08-25T00:00:04.279487"
  },
  {
    "kpi_name": "Units Sold by Product",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying top-selling products, optimizing inventory levels, adjusting marketing strategies, and focusing on product development for high-demand items.\n2. **Strategic Impact**: It aligns with the strategic objective of understanding product performance and market demand, which can inform product portfolio decisions and revenue growth strategies.\n3. **Operational Value**: It provides crucial insights for day-to-day operations such as inventory management, production planning, and sales forecasting.\n4. **Decision Making**: This KPI supports decision-making processes related to product pricing, promotions, and resource allocation based on sales performance.\n5. **Performance Monitoring**: It helps track the performance of products in the market, evaluate the effectiveness of sales efforts, and measure the success of marketing campaigns.\n\nOverall, the \"Units Sold by Product\" KPI holds high value as it offers actionable insights, aligns with strategic objectives, aids in operational decision",
    "timestamp": "2025-08-25T00:00:06.380027"
  },
  {
    "kpi_name": "Sales by Order",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which orders contribute the most to the total sales revenue. They can then focus on optimizing these high-revenue orders or replicating their success in other orders.\n2. **Strategic Impact**: This KPI aligns well with the business objective of maximizing revenue generation. By understanding the revenue contribution of each order, the company can make strategic decisions to improve overall sales performance.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by helping in identifying trends, patterns, and outliers in sales revenue by order. This information can be used to adjust pricing strategies, marketing efforts, or inventory management.\n4. **Decision Making**: Sales by Order KPI supports decision-making processes by providing data-driven insights into the effectiveness of different orders in generating revenue. This information can guide decisions related to product offerings, customer segmentation, and sales strategies.\n5. **",
    "timestamp": "2025-08-25T00:00:08.537443"
  },
  {
    "kpi_name": "Units Sold by Order",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the volume contribution of each order. They can identify high-performing orders and optimize strategies for low-performing ones.\n2. **Strategic Impact**: This KPI aligns with the business objective of maximizing sales volume and revenue generation. Understanding the units sold by order can help in strategic planning and forecasting.\n3. **Operational Value**: It provides valuable insights for day-to-day operations such as inventory management, production planning, and order fulfillment.\n4. **Decision Making**: The data on units sold by order can support various business decisions related to pricing, promotions, product bundling, and customer segmentation.\n5. **Performance Monitoring**: This KPI helps in tracking the performance of sales teams, marketing campaigns, and overall business growth based on the volume of units sold.\n\nOverall, the KPI of Units Sold by Order holds high value as it offers actionable insights,",
    "timestamp": "2025-08-25T00:00:10.681023"
  },
  {
    "kpi_name": "Sales by Shipping Method",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which shipping methods are generating the most revenue and optimizing strategies accordingly.\n2. **Strategic Impact**: It aligns with the business objective of maximizing revenue by providing insights into the effectiveness of different shipping methods.\n3. **Operational Value**: It helps in day-to-day operations by guiding decisions on shipping method selection and resource allocation.\n4. **Decision Making**: It supports business decisions by highlighting the impact of shipping methods on sales performance.\n5. **Performance Monitoring**: It helps track business performance by monitoring the revenue contribution of each shipping method over time.",
    "timestamp": "2025-08-25T00:00:12.609445"
  },
  {
    "kpi_name": "Units Sold by Shipping Method",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "This KPI provides valuable insights into the volume contribution of each shipping method, which can help business users make informed decisions regarding shipping strategies, inventory management, and customer satisfaction. It is actionable as it allows for adjustments in shipping methods based on performance, aligns with business objectives of optimizing operations and customer experience, aids in day-to-day operations by tracking shipping efficiency, supports strategic decisions related to logistics and supply chain management, and helps monitor performance in terms of shipping effectiveness and customer preferences.",
    "timestamp": "2025-08-25T00:00:14.061746"
  },
  {
    "kpi_name": "Sales by Attribute",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which attributes are driving sales and adjusting strategies accordingly.\n2. **Strategic Impact**: It aligns with the business objective of understanding revenue contribution by different attributes, which can inform strategic decisions.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by highlighting the performance of different attributes in driving sales.\n4. **Decision Making**: This KPI supports informed decision-making by providing visibility into the revenue generated by each attribute.\n5. **Performance Monitoring**: It helps track business performance by monitoring the sales contribution of various attributes over time.",
    "timestamp": "2025-08-25T00:00:15.582856"
  },
  {
    "kpi_name": "Units Sold by Attribute",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "This KPI, Units Sold by Attribute, holds high business value across all evaluation criteria. \n\n1. **Actionability**: Business users can take action based on this metric by identifying which attributes are driving sales and adjust strategies accordingly.\n2. **Strategic Impact**: It aligns with the business objective of understanding the volume contribution of different attributes, helping in strategic planning and resource allocation.\n3. **Operational Value**: It provides insights for day-to-day operations by highlighting which attributes are performing well and which may need improvement.\n4. **Decision Making**: This KPI supports business decisions by providing data on the performance of different attributes, aiding in decision-making processes.\n5. **Performance Monitoring**: It helps track business performance by quantifying the impact of each attribute on units sold, allowing for continuous monitoring and optimization.\n\nOverall, Units Sold by Attribute is a high-value KPI as it not only provides valuable insights into sales performance but also aids in strategic decision",
    "timestamp": "2025-08-25T00:00:18.055659"
  },
  {
    "kpi_name": "Sales by Date",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "The KPI \"Sales by Date\" holds high value across all evaluation criteria. \n1. Actionability: Business users can take action based on this metric by identifying trends, seasonality, and making informed decisions on sales strategies.\n2. Strategic Impact: It aligns with the business objective of monitoring revenue trends over time, which is crucial for strategic planning and forecasting.\n3. Operational Value: It helps in day-to-day operations by providing insights into daily sales performance, enabling adjustments in inventory, marketing, and sales efforts.\n4. Decision Making: It supports business decisions by providing a clear picture of sales performance, helping in setting targets, evaluating marketing campaigns, and optimizing sales strategies.\n5. Performance Monitoring: It aids in tracking business performance by monitoring sales trends, identifying growth opportunities, and assessing the effectiveness of sales initiatives.",
    "timestamp": "2025-08-25T00:00:20.095997"
  },
  {
    "kpi_name": "Units Sold by Date",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends, forecasting demand, adjusting inventory levels, and optimizing marketing strategies.\n2. **Strategic Impact**: It aligns with the business objective of monitoring sales performance and understanding market demand trends.\n3. **Operational Value**: It helps in managing day-to-day operations by providing insights into sales patterns and adjusting operational activities accordingly.\n4. **Decision Making**: It supports decision-making processes by providing data on sales performance, identifying opportunities for growth, and optimizing resource allocation.\n5. **Performance Monitoring**: It helps in tracking business performance by monitoring sales trends, evaluating the effectiveness of sales strategies, and measuring the success of marketing campaigns.",
    "timestamp": "2025-08-25T00:00:21.686801"
  },
  {
    "kpi_name": "Average Sales Price by Date",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by adjusting pricing strategies, promotions, or inventory levels to optimize sales and revenue.\n2. **Strategic Impact**: It aligns with the business objective of maximizing revenue and profitability by providing insights into price trends over time, which can inform strategic decisions.\n3. **Operational Value**: It helps with day-to-day operations by guiding pricing decisions and identifying patterns that can impact sales performance.\n4. **Decision Making**: It supports business decisions by providing valuable information on pricing strategies, product performance, and market trends.\n5. **Performance Monitoring**: It helps track business performance by monitoring changes in average sales prices and identifying factors that influence sales revenue.\n\nOverall, the Average Sales Price by Date KPI holds high value as it not only provides insights into price trends but also enables actionable decisions, aligns with strategic objectives, supports day-to-day operations, aids in decision-making processes, and",
    "timestamp": "2025-08-25T00:00:24.205353"
  },
  {
    "kpi_name": "Average Units per Order by Date",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in order sizes over time and adjusting strategies accordingly. For example, if the average units per order are decreasing, the business can explore ways to increase order sizes.\n2. **Strategic Impact**: This KPI aligns with the business objective of understanding and optimizing order size trends, which can directly impact revenue and profitability.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by helping in inventory management, forecasting, and pricing strategies.\n4. **Decision Making**: The KPI supports data-driven decision-making by providing a clear picture of how order sizes are evolving over time, enabling informed decisions on product offerings and promotions.\n5. **Performance Monitoring**: It helps track business performance by monitoring changes in average units per order, allowing the business to assess the effectiveness of various initiatives.\n\nOverall, the KPI of Average Units per Order by Date",
    "timestamp": "2025-08-25T00:00:26.354496"
  },
  {
    "kpi_name": "Total Orders by Date",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying peak order periods and adjusting resources accordingly to meet demand.\n2. **Strategic Impact**: It aligns with the business objective of understanding order volume trends, which can inform strategic decisions related to inventory management, marketing campaigns, and sales forecasting.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by helping in resource planning, optimizing order processing, and improving customer service.\n4. **Decision Making**: This KPI supports decision-making processes by providing data on historical order trends, enabling informed decisions on pricing, promotions, and product offerings.\n5. **Performance Monitoring**: It helps track business performance by monitoring order volume fluctuations, identifying growth opportunities, and evaluating the effectiveness of sales strategies.\n\nOverall, the Total Orders by Date KPI holds high value as it offers actionable insights, aligns with strategic objectives, aids in operational efficiency, supports decision-making",
    "timestamp": "2025-08-25T00:00:28.370025"
  },
  {
    "kpi_name": "Total Products by Date",
    "table_name": "tb_market_order_detail",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by adjusting product offerings based on trends in product variety over time. For example, they can introduce new products or discontinue slow-moving ones.\n2. **Strategic Impact**: This KPI aligns with the strategic objective of understanding product variety trends, which can help in product development, marketing strategies, and overall business growth.\n3. **Operational Value**: While it may not directly impact day-to-day operations, it provides valuable insights that can inform operational decisions related to inventory management, procurement, and sales strategies.\n4. **Decision Making**: The total number of unique products sold by date can support decisions related to product assortment, pricing strategies, and marketing campaigns.\n5. **Performance Monitoring**: This KPI helps track business performance by monitoring the evolution of product variety, which can indicate market demand, customer preferences, and overall business health.",
    "timestamp": "2025-08-25T00:00:30.445001"
  },
  {
    "kpi_name": "Total Orders",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in total orders, identifying peak periods, and adjusting inventory or staffing levels accordingly.\n2. **Strategic Impact**: Understanding the total volume of orders directly aligns with the business objective of maximizing sales and revenue.\n3. **Operational Value**: This KPI is crucial for day-to-day operations as it helps in managing inventory, forecasting demand, and optimizing production schedules.\n4. **Decision Making**: Total Orders KPI supports decision-making processes such as resource allocation, marketing strategies, and identifying potential growth opportunities.\n5. **Performance Monitoring**: It is essential for tracking business performance, evaluating the effectiveness of marketing campaigns, and assessing overall business growth.",
    "timestamp": "2025-08-25T00:00:32.234736"
  },
  {
    "kpi_name": "Total Unique Orders",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in total unique orders, identifying patterns, and adjusting marketing strategies or inventory levels accordingly.\n2. **Strategic Impact**: Understanding total unique orders aligns with the strategic objective of increasing sales and improving customer retention.\n3. **Operational Value**: This KPI helps in day-to-day operations by providing insights into customer behavior and demand patterns, which can inform inventory management and resource allocation.\n4. **Decision Making**: Total Unique Orders supports decision-making processes related to marketing campaigns, product offerings, and customer segmentation.\n5. **Performance Monitoring**: Tracking total unique orders allows businesses to monitor their performance in attracting and retaining customers, which is crucial for long-term success.",
    "timestamp": "2025-08-25T00:00:35.237163"
  },
  {
    "kpi_name": "Orders Per Day",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by adjusting staffing levels, inventory levels, or marketing strategies based on the daily volume of orders.\n2. **Strategic Impact**: Aligns with the business objective of understanding and optimizing operational efficiency and customer demand.\n3. **Operational Value**: Helps in managing day-to-day operations by providing insights into order processing and fulfillment.\n4. **Decision Making**: Supports decision-making processes related to resource allocation, inventory management, and sales forecasting.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of order volume trends and fluctuations.\n\nOverall, the Orders Per Day KPI holds high value as it provides actionable insights, aligns with strategic objectives, aids in operational management, supports decision-making, and helps monitor business performance effectively.",
    "timestamp": "2025-08-25T00:00:37.483727"
  },
  {
    "kpi_name": "Order Completion Rate",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "The Order Completion Rate KPI holds high value across all evaluation criteria. \n1. **Actionability**: Business users can take direct action based on this metric by identifying bottlenecks in the order completion process and implementing improvements to enhance efficiency.\n2. **Strategic Impact**: It aligns with the strategic objective of improving operational efficiency and customer satisfaction, as timely order completion is crucial for customer retention and loyalty.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations by highlighting areas that require attention to streamline the order fulfillment process.\n4. **Decision Making**: It supports data-driven decision-making by enabling management to allocate resources effectively, optimize processes, and prioritize initiatives that enhance order completion rates.\n5. **Performance Monitoring**: The Order Completion Rate KPI serves as a key indicator to track business performance and measure the effectiveness of operational processes in meeting customer demands.",
    "timestamp": "2025-08-25T00:00:39.889024"
  },
  {
    "kpi_name": "Order Cancellation Rate",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in order cancellations, investigating root causes, and implementing improvements to reduce cancellations.\n2. **Strategic Impact**: It aligns with business objectives related to efficiency and customer satisfaction, as reducing order cancellations can lead to increased revenue and customer loyalty.\n3. **Operational Value**: It helps with day-to-day operations by highlighting areas for process optimization and customer service improvements.\n4. **Decision Making**: It supports business decisions by providing insights into customer behavior and order processing effectiveness.\n5. **Performance Monitoring**: It helps track business performance by measuring the success of initiatives aimed at reducing order cancellations and improving overall order process efficiency.",
    "timestamp": "2025-08-25T00:00:41.588487"
  },
  {
    "kpi_name": "Average Time to Complete Order",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying bottlenecks in the order process and implementing improvements to streamline operations.\n2. **Strategic Impact**: It aligns with the business objective of improving efficiency, which can lead to cost savings and enhanced customer satisfaction.\n3. **Operational Value**: It provides insights into day-to-day operations by highlighting areas where processes can be optimized for faster order completion.\n4. **Decision Making**: This KPI supports decision-making by providing data on order processing efficiency, enabling informed decisions on resource allocation and process improvements.\n5. **Performance Monitoring**: It helps track business performance by measuring the average time taken to complete orders, allowing for continuous monitoring and benchmarking against targets.",
    "timestamp": "2025-08-25T00:00:43.262190"
  },
  {
    "kpi_name": "Average Time to Cancel Order",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying bottlenecks in the order cancellation process and implementing improvements to streamline the process, leading to better customer satisfaction.\n2. **Strategic Impact**: It aligns with the business objective of improving efficiency and customer satisfaction, which are crucial for long-term success and competitiveness.\n3. **Operational Value**: It provides insights into day-to-day operations by highlighting areas where delays in order cancellations may be occurring, allowing for operational adjustments to be made.\n4. **Decision Making**: This KPI supports decision-making by providing data on the efficiency of the order cancellation process, enabling informed decisions on process improvements.\n5. **Performance Monitoring**: It helps track business performance by measuring the average time taken to cancel orders, which is a key indicator of operational efficiency and customer service quality.",
    "timestamp": "2025-08-25T00:00:45.175183"
  },
  {
    "kpi_name": "Orders by Status",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying bottlenecks in order processing, addressing issues with specific order statuses, and optimizing workflows to improve overall efficiency.\n2. **Strategic Impact**: Understanding the distribution of orders by status aligns with the strategic objective of improving customer satisfaction and operational efficiency.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations by helping teams prioritize tasks, allocate resources effectively, and streamline order fulfillment processes.\n4. **Decision Making**: It supports decision-making by enabling data-driven decisions related to inventory management, resource allocation, and customer service improvements.\n5. **Performance Monitoring**: Tracking orders by status allows for real-time monitoring of business performance, identifying trends, and making timely adjustments to meet targets and KPIs.",
    "timestamp": "2025-08-25T00:00:48.043574"
  },
  {
    "kpi_name": "Orders by Day of Week",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by adjusting marketing strategies, staffing levels, or promotions on specific days with higher or lower order volumes.\n2. **Strategic Impact**: Understanding the distribution of orders by day of the week can align with business objectives related to optimizing sales, customer experience, and resource allocation.\n3. **Operational Value**: This KPI can help in planning inventory levels, staffing schedules, and logistics based on the order trends for each day of the week.\n4. **Decision Making**: It supports decision-making processes related to marketing campaigns, product launches, and operational efficiency by providing insights into peak order days.\n5. **Performance Monitoring**: Tracking orders by day of the week can help monitor the effectiveness of marketing initiatives, customer engagement, and overall business performance.\n\nOverall, the \"Orders by Day of Week\" KPI holds high value as it provides actionable insights, aligns with strategic objectives,",
    "timestamp": "2025-08-25T00:00:51.144551"
  },
  {
    "kpi_name": "Orders by Hour of Day",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by adjusting staffing levels, inventory management, and marketing efforts to align with peak order hours.\n2. **Strategic Impact**: Understanding the distribution of orders by hour of day can help in optimizing operations, improving customer experience, and increasing revenue, which aligns with business objectives.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations, allowing for better resource allocation and operational efficiency.\n4. **Decision Making**: It supports decision-making processes related to scheduling, promotions, and overall business strategy.\n5. **Performance Monitoring**: Tracking orders by hour of day helps in monitoring business performance and identifying trends or anomalies that may require attention.",
    "timestamp": "2025-08-25T00:00:52.862256"
  },
  {
    "kpi_name": "Orders by Month",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends and patterns in order volumes by month. For example, they can adjust inventory levels, marketing strategies, or staffing based on the order distribution.\n2. **Strategic Impact**: Understanding the distribution of orders by month aligns with the strategic objective of optimizing sales and operations planning. It helps in forecasting demand, identifying seasonality trends, and improving overall business performance.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations by helping in resource allocation, production planning, and inventory management based on the order patterns.\n4. **Decision Making**: The data on orders by month supports decision-making processes such as budget allocation, marketing campaign planning, and product launch timing.\n5. **Performance Monitoring**: Tracking the number of orders by month allows businesses to monitor their performance over time, compare against targets, and assess the effectiveness of business strategies.",
    "timestamp": "2025-08-25T00:00:54.405986"
  },
  {
    "kpi_name": "Orders by Year",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in order volume over the years and adjusting strategies accordingly.\n2. **Strategic Impact**: Understanding the distribution of orders by year aligns with the strategic objective of monitoring business growth and identifying areas for improvement.\n3. **Operational Value**: This KPI can help in forecasting demand, resource planning, and inventory management, providing operational value for day-to-day operations.\n4. **Decision Making**: The data on orders by year can support decision-making processes related to marketing campaigns, product launches, and overall business strategy.\n5. **Performance Monitoring**: Tracking the number of orders by year allows for monitoring business performance and evaluating the effectiveness of various initiatives.",
    "timestamp": "2025-08-25T00:00:56.143081"
  },
  {
    "kpi_name": "Average Order Value",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying trends in average order value and adjusting pricing strategies, promotions, or upselling techniques to increase revenue per order.\n2. **Strategic Impact**: Aligns with the business objective of maximizing revenue and profitability by focusing on increasing the average order value.\n3. **Operational Value**: Helps in day-to-day operations by providing insights into customer purchasing behavior and preferences.\n4. **Decision Making**: Supports decision-making processes related to pricing, product bundling, and marketing strategies to optimize revenue generation.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of revenue generation efficiency and effectiveness of sales strategies.",
    "timestamp": "2025-08-25T00:00:57.691899"
  },
  {
    "kpi_name": "Total Order Value",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in total order value, identifying high and low-performing periods, and adjusting strategies accordingly to increase revenue.\n2. **Strategic Impact**: Aligns with the key business objective of maximizing revenue and understanding the overall financial health of the company.\n3. **Operational Value**: Helps in day-to-day operations by providing a clear picture of the total revenue generated through orders, which can guide inventory management, resource allocation, and sales forecasting.\n4. **Decision Making**: Supports decision-making processes by providing insights into the effectiveness of sales and marketing strategies, pricing models, and customer segmentation.\n5. **Performance Monitoring**: Enables tracking of business performance over time, comparing against targets, and identifying areas for improvement to drive growth and profitability.",
    "timestamp": "2025-08-25T00:00:59.392879"
  },
  {
    "kpi_name": "Order Value by Status",
    "table_name": "tb_market_order_log",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by identifying which order statuses contribute the most to revenue and focusing on improving or optimizing those statuses.\n2. **Strategic Impact**: Understanding revenue distribution by order status aligns with the strategic objective of maximizing revenue and optimizing the order process.\n3. **Operational Value**: This KPI provides valuable insights for day-to-day operations by highlighting which order statuses are driving revenue and where operational improvements may be needed.\n4. **Decision Making**: It supports decision-making by providing data on revenue distribution, which can influence decisions related to resource allocation, marketing strategies, and customer service improvements.\n5. **Performance Monitoring**: This KPI helps track business performance by monitoring how revenue is distributed across different order statuses, allowing for ongoing evaluation and adjustment of strategies.\n\nOverall, the \"Order Value by Status\" KPI holds high value as it provides actionable insights, aligns with strategic objectives, aids",
    "timestamp": "2025-08-25T00:01:01.414810"
  },
  {
    "kpi_name": "Total Payments",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing trends in total payments to identify opportunities for increasing revenue or optimizing payment processes.\n2. **Strategic Impact**: Total Payments aligns directly with the business objective of maximizing revenue generation, making it strategically important.\n3. **Operational Value**: It provides valuable insights for day-to-day operations by tracking the financial health of the business and identifying any anomalies in payment patterns.\n4. **Decision Making**: Total Payments supports decision-making processes by providing a clear indicator of the financial performance of the business and guiding resource allocation.\n5. **Performance Monitoring**: This KPI is crucial for tracking business performance as it directly reflects the revenue generated from payments, making it a key indicator of overall business success.",
    "timestamp": "2025-08-25T00:01:03.111582"
  },
  {
    "kpi_name": "Average Payment",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "The Average Payment KPI provides valuable insights into the average revenue generated per payment, which is crucial for understanding the financial performance of the business. \n\n1. **Actionability**: Business users can take action based on this metric by analyzing trends in average payment amounts and identifying opportunities to increase revenue per payment.\n2. **Strategic Impact**: Aligns with the strategic objective of maximizing revenue and profitability by focusing on the average revenue generated per payment.\n3. **Operational Value**: Helps in optimizing pricing strategies, identifying high-value customers, and improving overall financial performance.\n4. **Decision Making**: Supports decision-making processes related to pricing, marketing strategies, and customer segmentation.\n5. **Performance Monitoring**: Enables tracking of business performance in terms of revenue generation and financial health. \n\nOverall, the Average Payment KPI is of high value as it provides actionable insights, aligns with strategic objectives, aids in day-to-day operations, supports decision-making, and helps in",
    "timestamp": "2025-08-25T00:01:06.500401"
  },
  {
    "kpi_name": "Total Shipping Cost",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing shipping costs, identifying cost-saving opportunities, negotiating better rates with shipping providers, or optimizing shipping processes.\n2. **Strategic Impact**: Shipping costs are a significant expense for many businesses, and managing them effectively can directly impact profitability and competitiveness, aligning with the strategic objective of cost optimization.\n3. **Operational Value**: Tracking total shipping costs can help in budgeting, forecasting, and managing operational expenses efficiently on a day-to-day basis.\n4. **Decision Making**: This KPI supports decision-making related to pricing strategies, product offerings, inventory management, and overall logistics planning.\n5. **Performance Monitoring**: Monitoring total shipping costs allows businesses to track cost trends, evaluate the effectiveness of cost-saving initiatives, and assess the overall financial health of the shipping operations.\n\nOverall, the Total Shipping Cost KPI provides valuable insights that can drive cost efficiencies, improve operational performance",
    "timestamp": "2025-08-25T00:01:09.496364"
  },
  {
    "kpi_name": "Average Shipping Cost",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "The Average Shipping Cost KPI holds high value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by analyzing trends in shipping costs, identifying cost-saving opportunities, negotiating better rates with shipping providers, and optimizing shipping strategies.\n2. **Strategic Impact**: It aligns with the business objective of cost optimization and efficiency in logistics operations.\n3. **Operational Value**: It provides insights into the day-to-day operations by monitoring shipping costs, identifying outliers, and ensuring cost-effective shipping practices.\n4. **Decision Making**: This KPI supports decision-making processes related to pricing strategies, product profitability analysis, and overall cost management.\n5. **Performance Monitoring**: It helps track business performance by monitoring the efficiency of shipping operations and cost control measures.\n\nOverall, the Average Shipping Cost KPI is of high value as it enables businesses to make informed decisions, optimize costs, and improve operational efficiency in the logistics and supply chain",
    "timestamp": "2025-08-25T00:01:11.909372"
  },
  {
    "kpi_name": "Total Commission",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "Total Commission is a crucial KPI with high business value. \n\n1. **Actionability**: Business users can take direct action based on this metric by analyzing commission earned and adjusting sales strategies or incentives to increase overall revenue.\n2. **Strategic Impact**: Aligns with the business objective of maximizing revenue and profitability, making it strategically important for the organization.\n3. **Operational Value**: Helps in day-to-day operations by providing insights into the effectiveness of sales efforts and identifying areas for improvement.\n4. **Decision Making**: Supports decision-making processes by providing a clear indicator of sales performance and revenue generation.\n5. **Performance Monitoring**: Enables tracking of business performance over time and comparison against targets or benchmarks. \n\nOverall, Total Commission is a high-value KPI that directly impacts business outcomes and provides actionable insights for driving revenue growth.",
    "timestamp": "2025-08-25T00:01:13.866593"
  },
  {
    "kpi_name": "Average Commission",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the average commission earned and identifying trends or patterns that can help optimize sales strategies or incentivize sales teams.\n2. **Strategic Impact**: Aligns with the business objective of maximizing revenue generation through commission-based sales.\n3. **Operational Value**: Helps in monitoring and managing day-to-day sales operations by providing insights into commission earnings.\n4. **Decision Making**: Supports decision-making processes related to sales performance, incentive structures, and resource allocation.\n5. **Performance Monitoring**: Enables tracking of sales performance and commission earnings over time to assess the effectiveness of sales efforts.\n\nOverall, the Average Commission KPI holds high value as it provides actionable insights, aligns with strategic objectives, supports operational activities, aids in decision-making, and facilitates performance monitoring in the sales domain.",
    "timestamp": "2025-08-25T00:01:15.790071"
  },
  {
    "kpi_name": "Total Payout to Capa",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "This KPI, Total Payout to Capa, holds high business value for the following reasons:\n1. **Actionability**: Business users can take action based on this metric by analyzing the total payout made to Capa and making decisions on optimizing or adjusting payouts.\n2. **Strategic Impact**: It aligns with the business objective of managing and monitoring payouts to Capa, which can impact overall financial performance.\n3. **Operational Value**: It provides insights into day-to-day operations related to payments and helps in ensuring efficient payout processes.\n4. **Decision Making**: This KPI supports decision-making processes related to budgeting, resource allocation, and performance evaluation.\n5. **Performance Monitoring**: It helps in tracking the performance of the payout process and evaluating the effectiveness of the payments made to Capa.\n\nOverall, Total Payout to Capa is a high-value KPI as it covers various aspects crucial for business operations and decision-making related to payouts",
    "timestamp": "2025-08-25T00:01:18.133268"
  },
  {
    "kpi_name": "Average Payout to Capa",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the average payout made to Capa and making adjustments to improve efficiency or cost-effectiveness.\n2. **Strategic Impact**: This KPI aligns with the business objective of monitoring and optimizing payouts to Capa, which can directly impact financial performance and vendor management strategies.\n3. **Operational Value**: It provides insights into day-to-day operations related to payments to Capa, allowing for better resource allocation and process improvements.\n4. **Decision Making**: The average payout to Capa can support decision-making processes related to vendor selection, negotiation, and performance evaluation.\n5. **Performance Monitoring**: This KPI helps track the efficiency and effectiveness of payment processes, enabling continuous monitoring and improvement efforts.",
    "timestamp": "2025-08-25T00:01:19.609782"
  },
  {
    "kpi_name": "Count of Completed Payouts to Capa",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: Business users can take action based on this metric by analyzing the count of completed payouts to Capa and identifying any trends or issues that may require attention.\n2. **Strategic Impact**: This KPI aligns with the business objective of monitoring transactions with Capa, which is crucial for financial management and relationship management.\n3. **Operational Value**: It provides insights into the day-to-day operations related to payouts to Capa, helping in monitoring and improving transaction efficiency.\n4. **Decision Making**: The count of completed payouts to Capa can support decision-making processes related to financial planning, resource allocation, and vendor management.\n5. **Performance Monitoring**: This KPI helps in tracking the performance of transactions with Capa, enabling the business to assess the effectiveness of its payment processes.\n\nOverall, this KPI holds high value as it covers various aspects such as actionability, strategic alignment, operational insights, decision support,",
    "timestamp": "2025-08-25T00:01:21.187880"
  },
  {
    "kpi_name": "Count of Incomplete Payouts to Capa",
    "table_name": "tb_payment_market",
    "rating": "HIGH VALUE",
    "reason": "1. **Actionability**: This KPI provides clear actionable insights as it indicates the number of pending transactions with Capa, allowing business users to prioritize and address incomplete payouts promptly.\n2. **Strategic Impact**: It aligns with the business objective of ensuring timely and accurate payouts to Capa, which can impact relationships with partners and overall financial health.\n3. **Operational Value**: It directly contributes to day-to-day operations by highlighting incomplete transactions that may require immediate attention to avoid delays or discrepancies.\n4. **Decision Making**: The count of incomplete payouts to Capa can support decision-making processes related to resource allocation, process improvements, and risk management.\n5. **Performance Monitoring**: This KPI helps in monitoring the efficiency of payout processes and tracking the progress in completing transactions, thus aiding in assessing business performance.\n\nOverall, this KPI holds high value as it not only provides real-time insights for operational improvements but also supports strategic decision-making and",
    "timestamp": "2025-08-25T00:01:22.918371"
  }
]