[
  {
    "kpi_name": "Total Cost of Quotations",
    "table_name": "tb_quotation",
    "reason": "Low business value: While tracking the Total Cost of Quotations can provide insights into the financial aspect of the quotation process, it may have limited business value in terms of actionable insights, strategic impact, operational value, decision making, and performance monitoring. Business users may not be able to take specific actions based solely on this metric, and it may not directly align with key business objectives or aid in day-to-day operations or decision-making processes. Additionally, there may be more relevant and impactful KPIs that could better track and improve business performance.",
    "timestamp": "2025-08-25T00:04:57.374202"
  },
  {
    "kpi_name": "Quotations Read Status",
    "table_name": "tb_quotation",
    "reason": "Low business value: While tracking the read status of quotations may provide some insights into engagement with the content, it lacks significant business value in terms of actionable insights, strategic impact, operational value, decision-making support, and performance monitoring. This KPI does not directly correlate with key business objectives or help in making informed decisions to drive business growth. It may not significantly impact day-to-day operations or provide a clear indication of business performance. Therefore, it is rated as low value in terms of overall business impact.",
    "timestamp": "2025-08-25T00:05:07.264959"
  },
  {
    "kpi_name": "Max Price Product",
    "table_name": "tb_market_product",
    "reason": "Low business value: While identifying the most expensive product can provide some insights into the product pricing strategy, it has limited actionable value for business users. It may not directly align with key business objectives or help with day-to-day operations. Additionally, the strategic impact of focusing solely on the highest-priced product may be limited, as it does not provide a comprehensive view of overall product performance or market dynamics. In terms of decision-making and performance monitoring, this KPI may not offer significant value compared to other metrics that provide a more holistic view of the business.",
    "timestamp": "2025-08-25T00:05:38.271848"
  },
  {
    "kpi_name": "Min Price Product",
    "table_name": "tb_market_product",
    "reason": "Low business value: While identifying the product with the lowest price can provide some insights into pricing strategies and market competitiveness, it has limited business value overall. It may not be actionable in terms of driving significant business decisions or strategies. Additionally, focusing solely on the minimum price product may not align with broader business objectives or provide comprehensive insights into overall performance or customer preferences. In terms of operational value, it may not significantly impact day-to-day operations or performance monitoring. Overall, this KPI may have limited strategic impact and may not be a top priority for business analysis.",
    "timestamp": "2025-08-25T00:05:39.351796"
  }
]