[
  {
    "kpi_name": "Sellers Without Address",
    "table_name": "tb_market_seller",
    "reason": "Low business value: While tracking the number of sellers without an address may have some operational value in terms of data completeness, it lacks significant business value in terms of actionable insights, strategic impact, and decision-making. It may not directly align with key business objectives or help in making informed decisions. Additionally, it may not be a critical metric for monitoring overall business performance. Therefore, this KPI is rated as low value.",
    "timestamp": "2025-08-25T00:18:35.460038"
  },
  {
    "kpi_name": "Sellers Without Detailed Address",
    "table_name": "tb_market_seller",
    "reason": "Low business value: While tracking the number of sellers without a detailed address may have some operational value in terms of data completeness, it lacks significant business value in terms of actionability, strategic impact, decision making, and performance monitoring. Business users may not be able to take direct action based solely on this metric, and it may not align closely with key business objectives or aid in strategic decision-making. Additionally, it may not have a direct impact on day-to-day operations or provide meaningful insights for performance monitoring. Therefore, the overall business value of this KPI is relatively low.",
    "timestamp": "2025-08-25T00:18:36.331618"
  },
  {
    "kpi_name": "Factories with Homepage",
    "table_name": "tb_sales_factory",
    "reason": "Low business value: While tracking the number of factories with a homepage may provide some insights into the digital presence of factories, it lacks significant business value in terms of actionability, strategic impact, operational value, decision making, and performance monitoring. This KPI does not directly translate into actionable steps for improving digital presence, aligning with strategic objectives, aiding day-to-day operations, informing critical business decisions, or monitoring overall business performance. As such, it is considered to have low value in driving business outcomes.",
    "timestamp": "2025-08-25T00:20:06.448198"
  },
  {
    "kpi_name": "Factories with Fax Number",
    "table_name": "tb_sales_factory",
    "reason": "Low business value: While knowing the number of factories with a fax number may provide some insight into communication capabilities, the business value of this KPI is limited. Fax communication is becoming increasingly outdated, and most businesses have shifted to more modern forms of communication. The metric may not be actionable as it does not directly impact business operations or strategic objectives. Additionally, it may not significantly contribute to decision-making or performance monitoring in a meaningful way. Therefore, the overall business value of this KPI is low.",
    "timestamp": "2025-08-25T00:20:10.795477"
  },
  {
    "kpi_name": "Factories with EIN",
    "table_name": "tb_sales_factory",
    "reason": "Low business value: While knowing the number of factories with a registered EIN may be important for compliance or legal purposes, it does not directly align with strategic business objectives, provide actionable insights, or significantly impact day-to-day operations or decision-making processes. This KPI may have limited value in terms of driving business performance or monitoring overall business success.",
    "timestamp": "2025-08-25T00:20:11.833143"
  },
  {
    "kpi_name": "Factories with Contact Name",
    "table_name": "tb_sales_factory",
    "reason": "Low business value: While having contact names for factories may be useful for communication purposes, this KPI does not provide significant actionable insights, strategic impact, operational value, or direct support for decision-making. It may not directly contribute to improving business performance or monitoring key business metrics. As such, the business value of this KPI is relatively low compared to other more impactful metrics.",
    "timestamp": "2025-08-25T00:20:18.392330"
  },
  {
    "kpi_name": "Service Types Without Images",
    "table_name": "tb_type_service",
    "reason": "Low business value: While tracking the count of service types without images may provide some insights into data completeness, it has limited business value in terms of actionable insights, strategic impact, operational value, decision-making support, and performance monitoring. It may not directly lead to specific actions or strategic decisions that drive business growth or efficiency. Additionally, the absence of images for certain service types may not necessarily indicate a critical issue that requires immediate attention. Therefore, this KPI is considered to have low value in the overall business context.",
    "timestamp": "2025-08-25T00:20:35.580251"
  },
  {
    "kpi_name": "Service Types With Parent",
    "table_name": "tb_type_service",
    "reason": "Low business value: While the KPI provides some insight into the structure of service types within the organization, it has limited business value in terms of actionability, strategic impact, operational value, decision making, and performance monitoring. Knowing the count of service types with parent services may not directly lead to actionable steps or strategic decisions. It may have limited impact on day-to-day operations or performance monitoring unless tied to specific business objectives or outcomes. In general, this KPI may not provide significant value in driving business success or improvement.",
    "timestamp": "2025-08-25T00:20:36.705795"
  },
  {
    "kpi_name": "Service Types With Description",
    "table_name": "tb_type_service",
    "reason": "Low business value: While tracking the count of service types with descriptions may provide some insights into data completeness or documentation practices, it has limited business value in terms of actionable insights, strategic impact, operational value, decision-making support, or performance monitoring. This KPI does not directly tie to revenue generation, cost reduction, customer satisfaction, or other critical business objectives. It may be more of a data quality or documentation metric rather than a key performance indicator with significant business impact.",
    "timestamp": "2025-08-25T00:20:39.674229"
  },
  {
    "kpi_name": "Service Types Without Description",
    "table_name": "tb_type_service",
    "reason": "Low business value: While tracking the count of service types without descriptions may provide some insights into data quality or completeness, the business value of this KPI is limited. It may not directly lead to actionable steps for business users, align significantly with strategic objectives, or have a substantial impact on day-to-day operations or decision-making processes. Additionally, it may not be a critical metric for monitoring overall business performance. Therefore, the overall business value of this KPI is relatively low.",
    "timestamp": "2025-08-25T00:20:40.862286"
  }
]